[
  {
    "url": "https://www.svce.ac.in/departments/information-technology/?page=profile",
    "content": "\nProfile\n    In 1996, Sri Venkateswara College of Engineering pioneered the introduction of the B.Tech degree programme in Information Technology under the affiliation of University of Madras. This is the first of its kind in Indian Universities. The department fulfills the requirements for the award of B.Tech Degree of Anna University.\n    The Venture was initiated under the guidance of our patron Dr.A.C.Muthiah and with the blessings of the Kanchi Paramacharya. When we started, the batch size was 30. This increased to 60 in 1998 and scaled up to 120 by the year 2000. Our growing numbers is indicative of the highly qualified and extremely dedicated teaching faculty of the department who strive for excellence in every sphere of their expertise.\n    It is the constant endeavor of the department to be in touch with changing needs of the IT Industry so as to be responsive in terms of modifications and introduction of new courses to adapt to these technological changes.\nVision \n    To produce higher caliber technologists and scientists for helping the country to attain new heights in Information Technology research and industrial needs to provide leadership in the field of technical education. \nMission \n    1. To develop the department into a “Centre of Excellence in Information Technology” offering engineering education to the students at Undergraduate, Postgraduate and Doctoral degree levels. \n    2. To build students' total personality emphasizing ethical values, and nurture them to meet the growing challenges in the Information Technology industry. \n    3. To examine the research challenges and cater diverse societal needs of the Nation.\nPROGRAMMES OFFERED\n    B.Tech Information Technology(UG Brochure)\n    M.E Computer Science and Engineering (NETWORKS) [Offered till AY 2022-2023]\n    M.Tech Cyber Forensics and Information Security(PG Brochure)\n    Doctor of Philosophy (Ph.D)\n\nB.Tech Information Technology\n    PROGRAMME EDUCATIONAL OBJECTIVES (PEOs)\n        The B.Tech Information Technology programme has the following Programme Educational Objectives(PEOs):\n            1. The graduates of Information Technology program will demonstrate themselves as leading professionals.\n            2. The graduates of Information Technology program will be equipped with the necessary skills to become proficient researchers.\n            3. The graduates of Information Technology program will demonstrate their abilities as successful entrepreneurs.\n            4. The graduates of Information Technology program will excel in higher studies or modern administrative services.\n\n    PROGRAMME OUTCOMES (POs)\n        1. Engineering Knowledge: Engineering Knowledge: Apply the knowledge of mathematics, science, engineering fundamentals and an engineering specialization to the solution of complex engineering problems.\n        2. Problem Analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences.\n        3. Design / Development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.\n        4. Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions.\n        5. Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.\n        6. The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.\n        7. Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.\n        8. Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.\n        9. Individual and team work: Function effectively as an individual and as a member or leader in diverse teams, and in multidisciplinary settings.\n        10. Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions.\n        11. Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.\n        12. Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change.\n\n    PROGRAMME SPECIFIC OUTCOMES (PSOs)\n        The B.Tech Information technology programme demonstrates the following two Programme Specific Outcomes (PSOs):\n            1. Exhibit proficiency in examining standard business operations in order to create and implement suitable Information Technology solutions.\n            2. Demonstrate the ability to establish an IT infrastructure, effectively manage resources, and ensure data security.\n\nM.E Computer Science and Engineering (Networks)\n    PROGRAMME EDUCATIONAL OBJECTIVES (PEOs)\n        The M.E Computer Science and Engineering (Networks) programme has the following Programme Educational Objectives(PEOs):\n            1. Evolve as globally competent networking professionals, researchers and entrepreneurs possessing 21st century skills, for developing innovative solutions to design, maintain, and manage network infrastructure and its application.\n            2. Gain expertise in the use of modern tools and techniques for developing computer network systems understanding the importance of social, business, technical, environmental, and human context in which the systems would work\n\n    PROGRAMME OUTCOMES (POs)\n        The M.E Computer Science and Engineering (Networks) programme demonstrates the following Programme Outcomes (POs):\n            PO1. An ability to independently carry out research /investigation and development work to solve practical problems.\n            PO2. An ability to write and present a substantial technical report/document.\n            PO3. Students should be able to demonstrate a degree of mastery over the area as per the specialization of the program. The mastery should be at a level higher than the requirements in the appropriate bachelor program\n\nM.Tech Cyber Forensics and Information Security\n    PROGRAMME EDUCATIONAL OBJECTIVES (PEOs)\n        The M.Tech Cyber Forensics and Information Security programme has the following Programme Educational Objectives(PEOs):\n            1. Evolve as globally competent cyber security professionals, researchers and entrepreneurs possessing 21st century skills, to define the architecture, design, and management of the security of an organization\n            2. Possess in-depth knowledge and skill sets in Cyber Security to monitor, prepare, predict, detect respond and prevent cyber-attacks and ensure enterprise security.\n\n    PROGRAMME OUTCOMES (POs)\n        The M.Tech Cyber Forensics and Information Security programme demonstrates the following Programme Outcomes (POs):\n            PO1. An ability to independently carry out research /investigation and development work to solve practical problems.\n            PO2. An ability to write and present a substantial technical report/document.\n            PO3. Students should be able to demonstrate a degree of mastery over the area as per the specialization of the program. The mastery should be at a level higher than the requirements in the appropriate bachelor program\n",
    "keywords": "information-technology departments"
  },
  {
    "url": "https://www.svce.ac.in/departments/information-technology/?page=academics",
    "content": "\nAcademics\n    The department of Information Technology is offering engineering education to the students to understand the various design areas in IT field and also to gain in-depth knowledge in IT industry. The outcome of this program is that the students will be able to organize an IT infrastructure, manage and monitor resources and safeguard the data. This program improves the analytical and programming skills of the students to meet the growing challenges in Information Technology industry as well as research institutes.\n\nCOURSES OFFERED\n    B.Tech Information Technology\n    M.E Computer Science and Engineering (NETWORKS) [Offered till AY 2022-2023]\n    M.Tech Cyber Forensics and Information Security\n    Doctor of Philosophy (Ph.D)\n\nTEACHING METHODOLOGIES\n    Experiential Learning\n        Industrial Visits\n        Projects\n        Internship/ In-Plant training\n        Hands-on Sessions/ Demonstration\n\n    Participative/ Collaborative Learning\n        Article Writing\n        Peer Learning\n        Tutorial Classes\n        Quiz\n        Group Discussion\n        Seminar\n        Hands-on training / Workshops\n\n    Provisions for Solving Complex Problems\n        Activity based assignments\n        SVCE Innovates\n        National / International Competitions\n        Symposiums\n        Hackathons\n        Paper Presentation\n        Technical programs\n        Societal Impact Projects\n\nInstruction & Communication Technology (ICT) Enabled Tools\n    Matlab / V-Lab\n    Google Class Room (GCR)\n    ERP / CMS\n    Simulation / Animation\n    Digital Writing Pad\n    You tube channel / Videos\n    Mentimeter\n    KAHOOT\n    PADLET\n    NEARPOD\n",
    "keywords": "information-technology academics"
  },
  {
    "url": "https://www.svce.ac.in/departments/information-technology/?page=people",
    "content": "\nPeople\n    The department comprises of about 30 faculty members who have specialized in various areas and 8 Technical staff members who are experts in System Administration and Networking.\n\nAREA OF SPECIALIZATION\n    Cyber Forensics and Information Security\t \n    Internet of Things\n    Machine Learning\t\n    Deep Learning\n    AI and Expert Systems\t\n    Data Science\n    Cloud Computing\tNatural \n    Language Processing\n    Networks and Security\t\n    Computer Architecture\n    VLSI and Embedded Systems\t\n    Multimedia Communications\n    Data Mining\t\n    Distributed Computing & Parallel Processing\n",
    "keywords": "information-technology people"
  },
  {
    "url": "https://www.svce.ac.in/departments/information-technology/?page=people&subMenu=faculty",
    "content": "\nFaculty\n    Professors\n        Dr.  V. Vidhya,  M.E., Ph.D, Head of the Department\n        Dr.  G. Sumathi,  M.E., Ph.D\n        Dr.  V.M. Sivagami,  M.E., Ph.D\n        Dr.  C. Yaashuwanth,  M.E., Ph.D\n        Dr.  T. Sukumar,  M.Tech., Ph.D, Assistant HoD\n\n    Associate Professors\n        Dr. N. Gobalakrishnan, M.Tech., Ph. D\n        Dr.  N. Devi,  M.E., Ph.D\n        Dr. D. Jayanthi,  M.E., Ph.D\n        Dr. P.  Leela Rani,  M.E.,Ph.D\n        Dr. A.  Kala,  M.E.,Ph.D\n        Dr. K.  Kiruthika Devi,  M.E.,Ph.D\n        Dr. P. Sharon Femi,  M.E., Ph.D\n        Dr. K. Suresh,  M.E.,Ph.D\n        Dr. A.  Indumathi,  M.Tech.,Ph.D\n\n    Assistant Professors\n        Dr. S. Kalavathi,  M.E., Ph.D\n        Ms. R. Saktheeswari,  M.E.,\n        Ms. N. Uma,  M.E.,\n        Ms. S. Jerusha,  M.Tech.,\n        Ms. M. Sugacini,  M.E.,\n        Mr. V. Ranjith,  M.E.,\n        Mr. AR. Guru Gokul,  M.E.,\n        Mr. E. Sivakumar,  M.E.,\n        Ms. S. Aiswarya,  M.E.,\n        Ms. P. Meenakshi,  M.E.,\n        Mr. V. Praveenkumar,  M.E.,\n        Mr. A. Thiyagarajan,  M.E.,\n        Ms. S. Kavishree,  M.Tech.,\n        Mr. N. Selvaganesh,  M.E.,\n        Mr. S. Siva Alagesh,  M.E.,\n        Ms. R. Elakya,  M.E.,\n        Ms. B. Umadevi,  M.E.,    \n",
    "keywords": "information-technology people faculty"
  },
  {
    "url": "https://www.svce.ac.in/departments/information-technology/?page=people&subMenu=staff",
    "content": "\nInstructors\n    Mr.  L. Francis Inigo Raj \n    Mr.  S. Sundarnarayanan \n    Mr.  K. Mohan \n    Ms. A. Gajalakshmi M.C.A.\n    Mr.  M. Eliyas Ahamed \n\nComputer Operator\n    Mr.  S. Manigandan \n\nJunior Assistant\n    Ms.  J. Ambica \n\nOffice Assistant\n    Mr.  V. Naveen Kumar \n",
    "keywords": "information-technology people staff"
  },
  {
    "url": "https://www.svce.ac.in/departments/information-technology/?page=facilities",
    "content": "\nFacilities\n    Conference Hall\n        The Mini Conference Hall housed in SVCE's Department of Information Technology accommodates a strength of around 35 members. Projector facilities and an air-conditioned environment is available here. Faculty meetings, project reviews and several other competitions like paper presentation are commonly conducted here.\n\n    Class Rooms\n        The classrooms are huge and spacious which can accommodate a seating capacity of around 60 students. It has windows at the sides so that the room doesn't become suffocating and fresh air prevails in the room. Overhead projectors are fitted in each classroom for provision of smart class facilities to enhance the quality of classroom learning.\n",
    "keywords": "information-technology facilities"
  },
  {
    "url": "https://www.svce.ac.in/departments/information-technology/?page=facilities&subMenu=laboratories",
    "content": "\nNational Resource Centre\n    SVCE is an accredited National Resource Centre of National Cyber Safety and Security managed by the Department of Information Technology. With several upcoming technical domains, it is equally important to leverage the cyber security standards to secure the technical work.\n\nModern Computing Laboratory\n    The Modern Computing Laboratory, is a hub for student sessions in User Interface Technologies and Cyber Security and Forensics labs. Our lab is a powerhouse in intuitive and innovative UI design, supported by extensive usability research, and advanced cyber forensics, offering expert analysis for complex digital case investigations. With a diverse range of expertise, we strive to deliver cutting-edge solutions that address both the design and security aspects of the digital landscape.\n\nNatural Language Processing and Data science Laboratory\n    The Natural Language Processing and Data Science Laboratory is a cutting-edge research facility dedicated to exploring the intersection of language processing and data analysis. Our lab leverages state-of-the-art machine learning techniques and computational linguistics to develop innovative solutions for a wide range of applications. From sentiment analysis and language generation to information extraction and knowledge representation, we strive to advance the frontiers of AI-driven language technologies.\n\nInternet of Things and Cyber Physical Systems Laboratory\n    The Internet of Things (IoT) and Cyber-Physical Systems (CPS) Laboratory is a research facility dedicated to studying and developing technologies related to IoT and CPS. Both IoT and CPS are cutting-edge fields that involve the integration of physical systems with digital technologies and the internet to create smart and interconnected environments. Students and faculty explore innovative technologies, algorithms, and methodologies to advance the capabilities and applications of IoT and Cyber-Physical Systems.\n\nNetwork and Cyber Security Laboratory\n    To explore the fascinating world of computer networks, data protection, and safeguarding against cyber threats. The primary goal is to develop a comprehensive understanding of network security principles, practices, and the tools necessary to protect digital assets and sensitive information from unauthorized access, data breaches, and other malicious activities.\n\nProgramming Laboratory\n    The programming laboratory is to provide students with a hands-on and practical learning environment to enhance their programming skills and gain a profound comprehension of programming concepts. The laboratory allows students to develop and refine their coding skills and analytic skills. The laboratory aims to make students industry-ready and familiar with the tools and practices commonly used in professional software development.\n",
    "keywords": "information-technology facilities laboratories"
  },
  {
    "url": "https://www.svce.ac.in/departments/information-technology/?page=facilities&subMenu=dept--library",
    "content": "\nDepartment Library\n    Library is a warehouse of knowledge encapsulated in the form of books which can bring a major transformation to the society if it falls in the right pair of hands. SVCE's Department of Information Technology has its very own library situated on the second floor of the block. The library in the department has a wide collection of technical books enabling easy access for both the faculty as well as students.\n\nLibrary Book details\n    S.No._Particulars_Total\n    1_Total Number of Volumes_1715\n    2_Total Number of Titles_984\n    3_Total Number of International Journals_139\n    4_Total Number of National Journals_18\n",
    "keywords": "information-technology facilities dept-library"
  },
  {
    "url": "https://www.svce.ac.in/departments/information-technology/?page=students-achievements",
    "content": "\nStudents Achievements\nHonors\n    Mr.Harish A and Mr. Abdullah. M (2015-19 batch) – Developers, SVCE PRO – official app - SVCE felicitated by our beloved chairman Dr.A.C.Muthiah.\n",
    "keywords": "information-technology students-achievements"
  },
  {
    "url": "https://www.svce.ac.in/departments/information-technology/?page=students-achievements&subMenu=academic",
    "content": "\nCOLLEGE RANK HOLDERS\nUG/PG BATCH NAME REGISTER NUMBER RANK CGPA \nUG 2017-2021 RAHUL R K 170801074 I 9.66 \nUG 2017-2021 KAAVIYA BASKARAN 170801041 II 9.48 \nUG 2016-2020 AARTHI K 160801002 I 9.68\nUG 2016-2020 MONISHA P S 160801054 II 9.57 \nUG 2015-2019 Sruthi V 212715205091 I 8.93\nUG 2015-2019 Pavithra G 212715205062 II 8.71    \n",
    "keywords": "information-technology students-achievements academic"
  },
  {
    "url": "https://www.svce.ac.in/departments/information-technology/?page=placements",
    "content": "\nPlacements\n    Placement Coordinators\n        Mr. AR. Guru Gokul, Assistant Professor, Assistant Placement Officer\n        Mr. N. Selvaganesh, Assistant Professor\n\nOUR RECRUITERS\n    Amazon, Mr. Cooper, EmbedUR, EY, Freshworks, Informatica, LatentView, Altimetrik, Mu Sigma, Temenos, Accenture, Zoho\n",
    "keywords": "information-technology placements"
  },
  {
    "url": "https://www.svce.ac.in/departments/information-technology/?page=research",
    "content": "\nResearch\n    Department of Information Technology was recognized as a research center by Anna University in April 2011. The research cell affiliated with the department provided support to two full-time research scholars and 21 part-time research scholars. Additionally, the research cell of Information Technology contributed to numerous student projects, faculty research, and student intramural projects.\n\nResearch Objectives\n    The number of publishing quality papers in National / International Journal should be equal to 20% of total faculty strength in every year.\n    The number of proposal for research work to various funding agency should be 30% of total faculty strength in every year.\n    Having at least one live externally funded project by every eligible department every year.\n    Mentoring at least two graduate/post graduate students/research scholars from each department to do research and subsequently to publish at least two papers in journal every year.\n    Retaining the Research centre status by eligible departments.\n    At least three eligible Research Supervisors of Anna University in eligible Departments.\n\nRESEARCH DOMAINS\n    Modern Computing \n    Network and Cyber Security \n    IoT and Cyber physical Systems \n    Natural Language Processing & Data Science\n",
    "keywords": "information-technology research"
  },
  {
    "url": "https://www.svce.ac.in/departments/information-technology/?page=research&subMenu=mou",
    "content": "\nList of Activities under MoU\n    Infoziant supports in various activities\n        Internship\n        Hackathon event\n        Technical Talk\n\n    Infosys\n        Infosys Campus Connect Faculty Enablement Programme (FEP) on User Interface Technologies held at Acharya Institute of Technology at Bangalore from 29-01-2018 to 03-02-2018.\n        Infosys organized Principal's Meet held at Infosys Ltd, Chennai DC Campus on 23-03-2018.\n        Infosys Campus connect Road Show event held at SVCE on 10-03-2018.\n        Infosys Campus connect Webinar on \"Guidelines for Hands on Assignment Creation\" held at SVCE on 25-01-2018.\n        Infosys Campus connect FEP on Foundation Program 5.0 held at REC from 23-04-2018 to 27-04-2018, Chennai.\n\n    Gemini Communications Pvt Ltd\n        The company offered internship to third year IT students in web development\n            Ms. Kanimozhi\n            Ms. Delphi\n            Mr. Bashyam\n\n    WriteIT Solutions Pvt Ltd.,\n        One day Guest lecture on “Whose work is it, anyway?” was delivered by Ms. Sukanya Sivakumar, CEO, WriteIT Solutions Pvt Ltd., on 22/03/2018 at SVCE campus.\n        One day Guest lecture on “The Role of Technology in Social Entrepreneurship” was delivered by Ms. Sukanya Sivakumar, CEO, WriteIT Solutions Pvt Ltd., on 12/10/2018 at SVCE campus for the benefit of IT and CS students under IEEE student chapter.\n",
    "keywords": "information-technology research mou"
  },
  {
    "url": "https://www.svce.ac.in/departments/information-technology/?page=technical-associations",
    "content": "\nTechnical Associations\n\nAssociation Activities - 2022 - 2023\nOffice bearers of AIT- Academic year 2022-2023\n\nThe following members have been elected as the Office bearers of the Association of Information  Technologists  (AIT)  for the academic  year  2022-2023\n    Post_Student Detail_Year \n    President_Deekshitha.M_Final Year IT ‘A’ Batch \n    Vice President_Sneha.M_Final Year IT ‘B’ Batch \n    General Secretary_Sanjiv.T.S_Third Year IT ‘B’ Batch\n    Treasurer_Lekhashree Rajesh_Third Year IT ‘A’ Batch\n    Executive Member (1)_Sowndariya.K_Second Year IT ‘B’ Batch\n    Executive Member (2)_Vivekanand Pandian M_Second Year IT ‘B’ Batch\n",
    "keywords": "information-technology technical-associations"
  },
  {
    "url": "https://www.svce.ac.in/departments/information-technology/?page=technical-associations&subMenu=iii-cell",
    "content": "\nIII Cell\n    The Industry Institute Interaction Cell (IIIC) creates the industry connection by signing MoUs for internships, projects, research and industry visits. This bridges the gap between the theoretical and practical aspects of the curriculum as well as academic and corporate world. The IIIC engages visiting faculty/professors and Industry experts for conducting workshops, seminars, and meetings. It also helps the department in joint research programmes and field studies by faculty and students based on industry’s requirement.    \n\nIndustrial Visit\n    Adani Port\n        Final Year Students visited Adani Port on Feb 13th 2023.\n\n    ISRO\n        Third Year Students Visited ISRO on April 11th 2023.\n\n    Amirthi Forest\n        Field visit to Amirthi Forest from the batch of B.Tech IT (2020-2024)\n\n    TN State Assembly\n        Industrial Visit to TN State Assembly from the batch of B.Tech IT (2019-2023)\n\n    ISRO\n        Industrial Visit to ISRO from the batch of B.Tech IT (2018-2022)\n",
    "keywords": "information-technology technical-associations iii-cell"
  },
  {
    "url": "https://www.svce.ac.in/departments/information-technology/?page=department-committee",
    "content": "\nDepartment Committee\n    Department Advisory Committee\n        The following members constitute the Department Advisory Committee (DAC) for the academic year 2023-24.\n    \n            S.No_Name and Designation_Members\n            1_Dr.V.Vidhya Professor & Head, Information Technology, SVCE_Chairman\n            2_Mr. Selvaganesh Govindan Senior Director Consulting, BFSI, Mind Tree_Industrial Member\n            3_Mr. E.Mahendran Joint Director, CDAC, Chennai_Industrial Member\n            4_Dr. P.Varalakshmi Professor, Department of Computer Technology Anna University, MIT Campus_Academic Member-External\n            5_Dr. Geetha Palanisamy Professor, Department of Computer Science and Engineering, CEG Campus, Anna University_Academic Member-External\n            6_Mr.S.Lakshmanan_Cloud Solution Specialist, Xencia Technology Solutions Pvt Ltd._Alumni Member\n            7_Mr. Durai Murugan Ramanujam Senior Business Analyst, Capgemini_Alumni Member\n            8_Mr.R.Sivakumar Tamil Nadu Agricultural Officer, Kallakurichi_Parent Member\n            9_Mr.S.Manikandan Program Manager, R & D division, TAFE Ltd, Chennai_Parent Member\n            10_Mr.T.S.Sanjiv, IV Year, Information Technology, SVCE_Student Member\n            11_Ms.M.Soundarya, III Year, Information Technology, SVCE_Student Member\n            12_Dr.G.Sumathi Professor, Information Technology, SVCE_Academic Member-Internal\n            13_Dr.V.M.Sivagami Professor, Information Technology, SVCE_Academic Member-Internal\n            14_Dr.T.Sukumar Professor & Asst HOD, Information Technology, SVCE_Academic Member-Internal\n            15_Dr.N.Devi Associate Professor, Information Technology, SVCE_Academic Member-Internal    \n",
    "keywords": "information-technology department-committee"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4297",
    "content": "\nName\tDr. V. Vidhya, ME, Ph.D.\nDesignation\tProfessor & Head of the Department\nAreas of Interest\tNatural Language Processing, Speech Coding, Machine Learning, Data Mining\nRoom No.\tDepartment of IT,First Floor Post Box No: 3, Pennalur, Sriperumbudur-602117\nIntercom No.\tPh:27152000 Ext:350\nEmail Id (Official)\thodit@svce.ac.in\nEmail Id (Personal)\tvidhyav@svce.ac.in\n",
    "keywords": "profile information-technology vidhya"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4364",
    "content": "\nName\tDr Sumathi G, PhD\nDesignation\tProfessor\nAreas of Interest\tDistributed Computing and Computer Networks\nRoom No.\tIT Dept. 1st Floor; Opp. to HoD Room\nIntercom No.\t352\nEmail Id (Official)\tgsumathi@svce.ac.in\n",
    "keywords": "profile information-technology sumathi"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4438",
    "content": "\nName\tSivagami V M , M.E. Ph.D\nDesignation\tProfessor\nAreas of Interest\tDistributed Systems, Grid & Cloud Computing, Operating Systems, Computer Networks\nRoom No.\tRoom no:11-105\nIntercom No.\tExtn:360\nEmail Id (Official)\tvmsiva@svce.ac.in\n",
    "keywords": "profile information-technology sivagami"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4493",
    "content": "\nName\tDr. C. Yaashuwanth, Ph.D.\nDesignation\tProfessor\nAreas of Interest\tEmbedded System\t\nIntercom No.\tExtn:361\nEmail Id (Official)\tyaashuwanth@svce.ac.in\n",
    "keywords": "profile information-technology yaashuwanth"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4730",
    "content": "\nName\tDr. Sukumar T, M.Tech., Ph.D.\nDesignation\tAssistant HoD and Professor\nAreas of Interest\tMobile Computing, Computer Networks, Data Mining and Warehousing, Adhoc Networks, Image Processing, Information Security\nRoom No.\tRoom no:11-006\nIntercom No.\tExtn:363\nEmail Id (Official)\tsukumart@svce.ac.in\n",
    "keywords": "profile information-technology sukumar"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=11962",
    "content": "\nName\tDr. N. Gobalakrishnan\nDesignation\tAssociate Professor\nAreas of Interest\tCloud Computing, Image Processing and Bigdata\nMobile\t9789708426\nEmail Id (Official)\tngobalakrishnan@svce.ac.in\nEmail Id (Personal)\tgobalakrishnanit@gmail.com\n",
    "keywords": "profile information-technology gobalakrishnan"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4734",
    "content": "\nName\tDr. N. Devi M.E., Ph.D\nDesignation\tAssociate Professor\nAreas of Interest\tMultimedia, Image Processing\nRoom No.\tRoom no:11-106\nIntercom No.\tExtn:361\nMobile\t98405 84719\nEmail Id (Official)\tnds@svce.ac.in\n",
    "keywords": "profile information-technology devi"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4797",
    "content": "\nName\tDr. D. Jayanthi\nDesignation\tAssociate Professor\nAreas of Interest\tCloud Computing, Machine Learning, Deep Learning\nRoom No.\tRoom No:11-106 (First floor System Software Lab)\nIntercom No.\tExtn:360\nMobile\t8056170188\nEmail Id (Official)\tjayanthi@svce.ac.in\n",
    "keywords": "profile information-technology jayanthi"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4784",
    "content": "\nName\tDr. P. Leela Rani, M.E., Ph.D\nDesignation\tAssociate Professor\nAreas of Interest\tWireless Sensor Networks, Data Mining\nRoom No.\tRoom no:11-104\nIntercom No.\tExtn:360\t\nEmail Id (Official)\tleela@svce.ac.in\n",
    "keywords": "profile information-technology leela-rani"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4816",
    "content": "\nName\tDr. A. Kala , M.E., Ph.D\nDesignation\tAssociate Professor\nAreas of Interest\tData Mining, Machine Learning, Image Processing\nRoom No.\t11-004\nIntercom No.\t360\nEmail Id (Official)\takala@svce.ac.in\n",
    "keywords": "profile information-technology kala"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4830",
    "content": "\nName\tKiruthika Devi K, M.E. Ph.D\nDesignation\tAssociate Professor\nAreas of Interest\tSocial Network Mining, Data Mining & Warehousing\nRoom No.\tRoom no:11-104\nIntercom No.\tExtn:360\nEmail Id (Official)\tkiruthika@svce.ac.in\n",
    "keywords": "profile information-technology kiruthika-devi"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5003",
    "content": "\nName\tDr. Sharon Femi P\nDesignation\tAssociate Professor\nAreas of Interest\tData Mining, Machine Learning\nRoom No.\tRoom no:11-004\nIntercom No.\tExtn:363\nEmail Id (Official)\tsharon@svce.ac.in\n",
    "keywords": "profile information-technology sharon-femi"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5368",
    "content": "\nName\tDr. K. Suresh, M.E., Ph.D\nDesignation\tAssociate Professor\nAreas of Interest\tCDMA Engineering,Mobile Communication\nRoom No.\tRoom no: 11-102\nIntercom No.\tExtn:362\nEmail Id (Official)\tksuresh@svce.ac.in\nEmail Id (Personal)\tksuresh_1987@yahoo.com\n",
    "keywords": "profile information-technology suresh"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5372",
    "content": "\nName\tDr. A. Indumathi , M.Tech.,Ph.D\nDesignation\tAssociate Professor\nAreas of Interest\tInformation Security, Distributed Systems, Cloud Computing\nRoom No.\tRoom no: 11-207\nIntercom No.\tExtn:361\nEmail Id (Official)\taindumathi@svce.ac.in\n",
    "keywords": "profile information-technology indumathi"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4977",
    "content": "\nName\tDr. S. Kalavathi, Ph.D\nDesignation\tAssistant Professor\nAreas of Interest\tDATA MINING, DATA STRUCTURES & ALGORITHMS, NETWORKING\nRoom No.\tIT 11-104\nIntercom No.\tEXTN: 360\nEmail Id (Official)\tkalavathi@svce.ac.in\nEmail Id (Personal)\tsknew1011@gmail.com\n",
    "keywords": "profile information-technology kalavathi"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5030",
    "content": "\nName\tSaktheeswari R, B.Tech., M.E.\nDesignation\tAssistant Professor\nAreas of Interest\tNetworking, Security, DBMS\nRoom No.\tRoom no:11-205\nIntercom No.\tExtn:361\t\nEmail Id (Official)\tsakthi@svce.ac.in\n",
    "keywords": "profile information-technology saktheeswari"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5385",
    "content": "\nName\tUma .N, M.E.\nDesignation\tAssistant Professor\nAreas of Interest\tCloud Computing, Mobile Cloud Computing, Data Mining, Network Security\nRoom No.\tRoom no:11-005\nIntercom No.\tExtn:361\t\nEmail Id (Official)\tnuma@svce.ac.in\n",
    "keywords": "profile information-technology uma"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5389",
    "content": "\nName\tJerusha S, M.Tech.\nDesignation\tAssistant Professor\nAreas of Interest\tWireless Sensor Networks\nRoom No.\tRoom No:11-203\nIntercom No.\tExtn:361\t\nEmail Id (Official)\tjerusha@svce.ac.in\n",
    "keywords": "profile information-technology jerusha"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5393",
    "content": "\nName\tM.Sugacini , M.E.\nDesignation\tAssistant Professor\nAreas of Interest\tWireless Sensor Networks, Operating Systems, DBMS\nRoom No.\tRoom No: 11-204\nIntercom No.\tExtn:361\t\nEmail Id (Official)\tmsugacini@svce.ac.in\nEmail Id (Personal)\tmsugacini@gmail.com\n",
    "keywords": "profile information-technology sugacini"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5395",
    "content": "\nName\tRanjith.V , M.E.\nDesignation\tAssistant Professor\nAreas of Interest\tNetworks, Object Oriented Concepts, Database\nRoom No.\tRoom no:11-206\nIntercom No.\tExtn:361\t\nEmail Id (Official)\tranjithv@svce.ac.in\n",
    "keywords": "profile information-technology ranjith"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5396",
    "content": "\nName\tGuru Gokul AR , M.E.\nDesignation\tAssistant Professor\nAreas of Interest\tComputer Networks, Cryptography and Network Security, Blockchain\nRoom No.\tRoom no:10-105\nIntercom No.\tExtn:351\t\nEmail Id (Official)\tgurugokul@svce.ac.in\nEmail Id (Personal)\tgurugokul007@gmail.com\n",
    "keywords": "profile information-technology guru-gokul"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5397",
    "content": "\nName\tSivakumar E, M.E.\nDesignation\tAssistant Professor\nAreas of Interest\tProgramming, Data Structures, Algorithm Design\nRoom No.\t11-006, IT Block\nIntercom No.\tExtn:363\t\nEmail Id (Official)\tsivakumare@svce.ac.in\nEmail Id (Personal)\tsivakumareswaran@gmail.com\n",
    "keywords": "profile information-technology sivakumar"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=7756",
    "content": "\nName\tAiswarya S\nDesignation\tAssistant Professor\nAreas of Interest\tData Mining, Machine Learning\nRoom No.\t11-203\nIntercom No.\tExt 361\nEmail Id (Official)\taiswaryas@svce.ac.in\n",
    "keywords": "profile information-technology aiswarya"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=8532",
    "content": "\nName\tMeenakshi P, M.E.\nDesignation\tAssistant Professor\nAreas of Interest\tMachine Learning, Network Security\nRoom No.\tRoom No: 11-204\nIntercom No.\tExt: 361\t\nEmail Id (Official)\tmeenakship@svce.ac.in\n",
    "keywords": "profile information-technology meenakshi"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=9861",
    "content": "\nName\tPraveenkumar V, M.E.\nDesignation\tAssistant Professor\nAreas of Interest\tComputer Networks, Operating Systems, Artificial Intelligence\nRoom No.\tRoom no:11- 002\nIntercom No.\tExtn:363\nMobile\t9976478020\nEmail Id (Official)\tpraveenkumarv@svce.ac.in\nEmail Id (Personal)\tpraveen.k930@gmail.com\n",
    "keywords": "profile information-technology praveenkumar"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=9863",
    "content": "\nName\tThiyagarajan A, M.E.\nDesignation\tAssistant Professor\nAreas of Interest\tImage Processing, Artificial Intelligence\nRoom No.\tRoom No: 11 – 206\nIntercom No.\tExtn:361\nMobile\t9962261998\nEmail Id (Official)\tthiyagarajana@svce.ac.in\n",
    "keywords": "profile information-technology thiyagarajan"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=15588",
    "content": "\nName\tS. Kavishree, M.Tech.\nDesignation\tAssistant Professor\nAreas of Interest\tData warehousing and mining, Artificial intelligence , Big data analytics\nRoom No.\t11-208\nIntercom No.\t361\t\nEmail Id (Official)\tkavishrees@svce.ac.in\nEmail Id (Personal)\tkavisampath311@gmail.com\n",
    "keywords": "profile information-technology kavishree"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=16237",
    "content": "\nName\tMr. N. Selvaganesh\nDesignation\tAssistant Professor\nAreas of Interest\tMachine Learning, Deep Learning\nRoom No.\t11-208\nIntercom No.\t361\nMobile\t8124419925\nEmail Id (Official)\tselvaganeshn@svce.ac.in\nEmail Id (Personal)\tselva492@gmail.com\n",
    "keywords": "profile information-technology selvaganesh"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=17264",
    "content": "\nName\tMr. S. Siva Alagesh\nDesignation\tAssistant Professor\nAreas of Interest\tMachine Learning, Block Chain\nRoom No.\t11-002\nIntercom No.\t363\nMobile\t8124464847\nEmail Id (Official)\tsivaalageshs@svce.ac.in\n",
    "keywords": "profile information-technology siva-alagesh"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=17274",
    "content": "\nName\tMrs. R. Elakya\nDesignation\tAssistant Professor\nAreas of Interest\tDeep Learning, Image Processing\nRoom No.\t11-205\nIntercom No.\t361\nMobile\t9884852306\nEmail Id (Official)\telakyar@svce.ac.in\nEmail Id (Personal)\telakyaragesh@gmail.com\n",
    "keywords": "profile information-technology elakya"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=18265",
    "content": "\nName\tUmadevi B, M.E.\nDesignation\tAssistant Professor\nAreas of Interest\tData Science, Machine Learning\nRoom No.\t11-205\nIntercom No.\t361\nEmail Id (Personal)\tumaravi07@gmail.com\n",
    "keywords": "profile information-technology umadevi"
  },
  {
    "url": "https://www.svce.ac.in/admission/admission-procedure/b-e-b-tech-admissions-2/",
    "content": "\nAdmission Procedure\n    B.E./ B.Tech Admissions\n        Admissions Overview\n            SVCE is one of the pioneers in engineering education, excelling since 1985. It has got the Autonomous status since 2016. All B.E./B.Tech and M.E./M.Tech programs are affiliated to Anna University, Chennai and the final degree will be awarded by Anna University. Admissions into various programs are as per the norms laid down by the Department of Technical Education, Government of Tamil Nadu and Anna University.\n            The Government of Tamil Nadu undertakes admissions to B.E. / B.Tech. programs of all the affiliated colleges through a common merit list of administered by Directorate of Technical Education. Further details on this would be available at www.annauniv.edu. Admissions to B.E./B.Tech programs will be based on marks secured in Higher Secondary Exam as per Tamilnadu Engineering Admissions regulations.\n\n        Eligibility\nA pass in the HSC (Academic: both +1 and +2) or its equivalent with a minimum average percentage in Mathematics, Physics and Chemistry put together as given below:\n                Community_A Pass with Minimum average marks in Mathematics, Physics and Chemistry put together\n                General Category_45.00%\n                Backward Class including Backward Class Muslim_40.00%\n                MBC & DNC_40.00%\n                SC/SCA/ST_40.00%\n\n        Admissions under Management Quota\n            Out of the 1020 total seats, 50% are filled up through Tamil Nadu Government Department of Technical Education Online-counseling. To be noted is that the seats offered by SVCE are filled up within the first few days of counseling with significant-high cut-off marks. The remaining 50% seats are filled through management quota, as per the Govt. norms. We are inviting candidate registration for counseling to apply for Management Quota.\n\nAdmission Eligibility for B.E. Marine Engineering (For both Government Quota & Management Quota admission)\n    Regular Admission in First year\n        A pass in HSC (12th) with a minimum of 60% in Physics ,Chemistry & Mathematics\n        Minimum of 50% Marks in English during 10th or 12th standard\n        Qualifying in Common Entrance Test (CET) conducted by Directorate General of Shipping, Govt. of India approved agency\n        Medical fitness certificate & Merchant Marine Psychometric Evaluation Certificate obtained from Directorate General of Shipping approved Medical Officer. (List of DGS Approved Medical Officers)\n        A Valid passport is required at the time of admission\n    \n    Lateral Entry Admission in Second year\n        A pass in 3 years Diploma in Mech. / Marine / EEE / ECE with minimum 55% marks in final year\n        Minimum of 50% in English during 10th standard or Diploma\n        Qualifying in Common Entrance Test (CET) conducted by Directorate General of Shipping, Govt. of India approved agency for Diploma passed candidates\n        Medical fitness certificate & Merchant Marine Psychometric Evaluation Test certificate obtained from Directorate General of Shipping approved Medical Officer. (List of DGS Approved Medical Officers)\n        A Valid passport is required at the time of admission\n\n    For B.E Marine Engineering Admission Related Queries, Contact : Dr. M. Anandan, Mobile & WhatsApp No: 9443813896, Email: anand@svce.ac.in\n    Common to all Degree Programs\n        1. Admissions are offered only to Indian Citizens / NRI.\n        2. We do not have provisions to admit students from PIO/OCI category.\n",
    "keywords": "admission admission-procedure BE-BTech-Admissions"
  },
  {
    "url": "https://www.svce.ac.in/admission/admission-procedure/b-e-b-tech-lateral-entry-admissions/",
    "content": "\n    B.E./ B.Tech Lateral Entry Admissions\n        Lateral Entry Admissions into various programs are as per the norms laid down by the Department of Technical Education, Government of Tamil Nadu and Anna University. The program is designed for candidates with a 3-year diploma in engineering (10+3 pattern) or an equivalent degree to get direct admission to the 2nd year B.E./B.Tech program.\n\n    Eligibility\n        Passed a diploma in any branch of Engineering / Technology with a minimum of marks as given below.\n        OR\n        Passed B.Sc Degree in any recognized University with a minimum of marks as given below and passed 10+2 examination with mathematics as a subject.\n\n    Community_A Pass with Minimum marks in any Diploma in Engineering / Technology or B.Sc degree\n        General Category_45.00%\n        Backward Class including Backward Class Muslim_40.00%\n        MBC & DNC_40.00%\n        SC/SCA/ST_40.00%\n",
    "keywords": "admission admission-procedure BE-BTech-Lateral-Entry-Admissions"
  },
  {
    "url": "https://www.svce.ac.in/admission/admission-procedure/b-e-b-tech-nri-admissions/",
    "content": "\nB.E/B.Tech. NRI Admissions\n    Admissions to B.E. / B.Tech. programs under NRI Category will be based on marks secured in Higher Secondary Exam as per Tamilnadu Engineering Admissions Regulations.\n    For a candidate to be considered for admissions under this category he/she should be financially supported by a Non-Resident Indian (NRI). The NRI financially supporting the candidate should either be the parent (Father or Mother) of the candidate or legally declared as guardian of the candidate by the Court as per provisions in “The Guardians and Wards Act, 1890”.\n\n    List of documents required for Non-Resident Indians (NRI) Category\n        S.No._Documents\n        1_NRI status certificate of the father or mother (financial supporter)issued by the Indian Embassy of the respective country in ORIGINAL\n        2_Sponsorship letter from the financial supporter stating that he/she will financially support the education of the candidate\n        3_Employment certificate of the financial supporter issued by the foreign employer\n        4_Relationship certificate and Nativity Certificate of the financial supporter obtained from the Tahsildar\n        5_Attested copy of NRE (Non-Resident External) Bank Account statement for last 3 months transaction of the financial supporter\n        6_Attested copy of the valid Indian Passport of the NRI financial supporter\n        7_Eligibility certificate issued by Association of Indian Universities\n        8_Copy or 1000$ DD/ Equivalent INR\n        9_Original Mark sheets of Class 10, 11 at the time of interview    \n",
    "keywords": "admission admission-procedure BE-BTech-Nri-Admissions"
  },
  {
    "url": "https://www.svce.ac.in/admission/admission-procedure/m-e-m-tech-admissions/",
    "content": "\n    M.E./ M.Tech Admissions\n        Admissions to all M.E./M.Tech programs at SVCE will be based on marks or grades obtained in B.E./B.Tech program and scores of TANCET/CET conducted by Consortium of Colleges as per Tamilnadu Common Entrance Test Regulations.\n\n    Programs Offered\n        1. M.E. Industrial automation and Robotics\n        2. M.E. Mechatronics\n        3. M.E. Communication Systems\n        4. M.E. Power Electronics & Drives\n        5. M.E. Computer Science & Engineering\n        6. M.E. Computer Science & Engineering ( Networks )\n        7. M.Tech. Chemical Engineering\n        8. M.Tech. Bio Technology\n\n    Highlights\n        – Opportunity to work as ‘Project Assistant’ in sponsored projects by Goverment Organisations with an attractive stipend\n        – Opportunity to work as ‘Teaching Assistant’ in the institute while undergoing the Program\n        – 100% ‘Placement Assistance’ and exclusive training programs\n        – Flexible 3+1 semester pattern- the curriculum is designed in such a way that students will carry out their research\n            during their entire fourth semester\n\n    Scholarships\n        – Upto 30% of the students get a full waiver on Tuition fee based on eligibility\n        – GATE Scholarship of Rs. 12,400 per month for students having valid GATE Score.\n        – Intramural Research Grant to carry out innovative projects.    \n",
    "keywords": "admission admission-procedure ME-MTech-Admissions"
  },
  {
    "url": "https://www.svce.ac.in/admission/admission-procedure/research-programs/",
    "content": "\n    Research Programs\n        Admission to Ph.D. programs with the recognized Research Centres at all affiliated colleges are made by Centre for Research, Anna University, Chennai twice a year. Aspiring research scholars are expected to get in touch with the recognized supervisors associated with the research centres to fix a tentative research topic and obtain their consent for being a supervisor to the applicant.\n        The applicants desirous of taking up Ph.D. programs with any of the 11 SVCE areas of research recognized by Anna University(https://www.svce.ac.in/research/research-area/) are requested to contact the recognized supervisors at the above centres. The details regarding the entrance tests for Ph.D. admission and other rules are available at www.annauniv.edu/research.    \n",
    "keywords": "admission admission-procedure research-programs"
  },
  {
    "url": "https://www.svce.ac.in/admission/scholarships/",
    "content": "\nScholarships\n    Scholarship Scheme I\n        Dr. A. C. Muthiah, Chairman, Governing Council initiated a new scheme from academic year 2003-2004 to distribute 5% of tuition fees income to students as:-\n            1. Full Semester Tuition Fees Scholarship\n            2. Prizes for First Rankers in Test and Examination\n\nFull semester Tuition fees Scholarship\n    Students will be given full semester fees as scholarship on the basis of:\n        Meritorious academic performance\n        Merit cum Means\n        Economic Means and Performance in Sports and NCC activities\n\nPrizes for First Rankers in Test and Examination\n    Prizes will be given to the first rank holder in Continuous Assessment Tests (CAT) of each class in every semester and University Semester Examination of each branch, every semester.\nScholarship Scheme II\n    The College has Rs. 64 lakhs as Scholarship Fund as on 31st March 2010. The interest accruing on the fund is utilized for giving assistance for purchasing books & instruments and awarding medals & prizes. The list of major donors and the amount contributed by them is shown below.\n\nAssistance for books and instruments\n    The grant for books and instruments to the students are distributed annually on the basis of:\n        Meritorious academic performance\n        Merit cum Means\n        Economic Means and\n        Performance in Sports and NCC activities\nScholarship to Marine Engineering Student\n    Scholarship of Rs.40,000/- each to an outstanding student of Second, Third and Final year of Marine Engineering course based on his performance in the respective year of study is given by Vasant J. Sheth Memorial Foundation, Mumbai.\n",
    "keywords": "admission scholarships"
  },
  {
    "url": "https://www.svce.ac.in/admission/medals-awards/",
    "content": "\nMedals and Awards\n    Gold Medals\n        Gold Medals are awarded to University rank holders coming within first 10 ranks. Silver Medals are awarded to College First rank holders.\n    Devaki Muthiah Endowment Award\n        This award carries a citation, a silver plaque and a cash prize. This is given to a final year undergraduate student for exceptional all round performance in academic, professional, sports, NCC, etc.\n    Panickker Award\n        This award was initiated by M/s Panickker Switch Gear Pvt. Ltd, Chennai. This award is given to a pre-final year undergraduate student for exceptional academic performance and significant contribution to professional activities. It carries a citation, a rolling shield and a cash prize.\n    Outstanding Sportsperson Award\n        This award carries a citation, a silver plaque and a cash prize. This is given to a final year student (U.G/P.G.) for exceptional performance in sports, contribution to the growth of sports in the college and for encouraging fellow students to participate in sports activity.\n    Outstanding NCC Cadet Award\n        This award carries a citation, a silver plaque and a cash prize. This is given to a final year student (U.G / P.G) for exceptional all round performance in NCC.\n    Outstanding M.E / M.Tech Student Award\n        This award carries a citation, a silver plaque and a cash prize. This is given to a final year M.E./M.Tech. student for exceptional all round performance in academic, professional, sports, NCC, etc.\n    Outstanding M.C.A Student Award\n        This award carries a citation, a silver plaque and a cash prize. This is given to a final year MCA student for exceptional all round performance in academic, professional, sports, NCC, etc.\n    Outstanding Marine Engineering Student Award\n        This award carries a citation, a Gold Medal and a cash prize. This is given to a final year undergraduate student for exceptional all round performance in academic, professional, sports, NCC, etc. This award was instituted by Vasant J. Sheth Memorial Foundation and awarded as “Vasant J. Sheth Gold Medal”\n    Best Student Award by ISTE\n        This award carries a medallion and a citation plaque given by Indian Society for Technical Education in the annual Student convention held anywhere in India to the best student of ISTE – SVCE – Student chapter. The traveling expenses incurred by for the student to receive the award will be borne by College/Chapter.\n    Sree Hareehara Sudhan Educational Trust Award\n        This award carries a citation, a silver medal and a cash prize. This is given to the College First Rank holder in B.Tech, Chemical Engineering. The award was instituted by Mr.S.Tamilselvan father of late Sri. T.Hareehara Sudhan, B.Tech. (Chemical Engineering), 2000 Batch.\n    CETHAR – CVL Award for Best Outgoing Mechanical Engineer\n        This award carries a citation, a silver and a cash prize. This is given to a final year B.E. Mechanical Engineering student for exceptional all round performance in academic, professional, sports, NCC, etc. This award was instituted by CETHAR-CVL, Tiuchi.\n    TAFE – Massey Ferguson Awards\n        1. Best Innovative Mechanical Engineering Project: This award carries a citation, a gold medal and a cash prize. This award is given to a final year undergraduate student of Mechanical Engineering for best innovative project.\n        2. Best Innovative Automobile Engineering Project: This award carries a citation, a gold medal and a cash prize. This award is given to a final year undergraduate student of Automobile Engineering for best innovative project.\n        These awards were instituted by M/s Tractors And Farm Equipments Limited (TAFE), Chennai.\n    Dr V P Krishnamoorthy Award for Outstanding Computer Science and Engineering Student\n        This award carries a citation, silver medal and a cash prize. This is given to a final year B.E. Computer Science and Engineering student for exceptional all round performance in academic, professional, sports, NCC, etc. This award was instituted by Dr Venkatesh Krishnamoorthy, an Alumnus of our College (1990 Graduate).\n    Biotechnology Alumni Award\n        This award carries a citation and a cash prize. This is given to a third year B.Tech. Biotechnology student for for exceptional all round performance in academic, professional, sports, NCC, etc. This award was instituted by 2005-2009 batch BTech Biotechnology alumni in the year 2009.\n    Rangachary Award for Electronics and Communication Engineering Student\n        This award carries a silver medal and a cash prize. This is given to a final year for BE Electronics and Communication Engineering Student for exceptional performance in academics. This award was instituted by Mr Sriram Rangachary, an Alumnus of our college (1989 Graduate).\n    TSK Award for Third year Computer Science Girl Student\n        This award carries a cash prize. This award is given to a third year B.E. Computer Science and Engineering Girl student on a Merit-cum means basis. This award was instituted by Dr.Venkatesh Krishnamoorthy, an Alumnus of our college in honour of his mother.    \n",
    "keywords": "admission medals-awards"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=profile",
    "content": "\nAbout the Department\n    The Department of Computer Science and Engineering was established in the year 1985. Over the past few years, the department has acquired national and international importance. This has been achieved by the collective and responsive effort of the faculty, the supporting staff and the students.\n    The department is well equipped with excellent computing facilities, and has highly qualified faculty specialized in areas like Cloud Computing, Artificial Intelligence, Data Analytics, Networking, Data Mining etc.\n\n    Programs offered by the department are\n        B.E. Computer Science and Engineering\n        B.Tech. Artificial Intelligence and Data Science\n        M.E. Computer Science and Engineering\n        Ph.D. Computer Science and Engineering\n\n\nHistory of the Program\nProgram of Study_Description\n    UG Program - B.E. Computer Science and Engineering\t\n        Started with 60 seats in 1985\n        Intake increased to 120 seats in 2000\n        Intake increased to 180 seats in 2012\n        Accredited by NBA - January 1998 for 3 Years\n        Accredited by NBA - July 2008 for 3 Years\n        Provisionally Accredited (2014 - 2016)\n        Provisionally Accredited (2016 - 2017)\n        Provisionally Accredited (2017 - 2020)\n        Provisionally Accredited (2020 - 2021)\n    UG Program - B.Tech. Artificial Intelligence and Data Science\t\n        Started with 60 seats in 2020\n    PG Program - M.E. Computer Science and Engineering\t\n        Started with 18 seats in 2002\n        Intake increased to 25 seats in 2003\n        12 Seats from the year 2021\n        6 Seats from the year 2022\n    Ph.D\t\n        Recognized as a Research Centre by Anna University, Chennai in January 2010.\n\n\nVision\n    To excel in providing education and research in the field of computer science and engineering in the cutting - edge technology so as to produce competence professional at global level\n\nMission\n    Providing competent and trained faculty members to enrich the aptitude of the student to generate innovative and effective problem - solving skills with professionalism\n    Providing strong research and state of the art facility to the students to face dynamic challenges of industry and society\n    Educating the students to be successful, ethical and lifelong learners\n\n\nB.E - Computer Science and Engineering\n    Program Educational Objectives (PEOs)\n        Graduates will be able to\n            Create value to organizations as an employee at various levels, by improving the systems and the processes using appropriate methods and tools learnt from the program\n            Run an organization successfully with good social responsibility as an entrepreneur, making use of the knowledge and skills acquired from the program\n            Contribute to the future by fostering research in the chosen area as an erudite scholar, based on the motivation derived from the program\n\n    Program Outcomes (POs)\n        Engineering Graduates will be able to:\n            1. Engineering Knowledge: Apply the knowledge of mathematics, science, engineering fundamentals and an engineering specialization to the solution of complex engineering problems.\n            2. Problem Analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences.\n            3. Design / Development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.\n            4. Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, andsynthesis of the information to provide valid conclusions.\n            5. Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.\n            6. The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.\n            7. Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.\n            8. Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.\n            9. Individual and team work: Function effectively as an individual and as a member or leader in diverse teams, and in multidisciplinary settings.\n            10. Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend andwrite effective reports and design documentation, make effective presentations, and give and receive clear instructions.\n            11. Project management and finance: Demonstrate knowledge and understanding of the engineering management principles and apply these to one's own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.\n            12. Life-long learning: Recognize the need for and have the preparation and ability to engage in independent and lifelong learning in the broadest context of technological change\n\n    Program Specific Outcomes (PSOs)\n        1.Ability to adapt to a rapidly changing environment by learning and employing new programming skills and technologies.\n        2.Ability to use diverse knowledge across the domains with inter-personnel skills to deliver the Industry need.\n\n\nB.Tech - Artificial Intelligence and Data Science\n    Program Educational Objective (PEOs)\n        Artificial Intelligence and Data Science program will prepare its graduates:\n        Graduates will be able to\n            1. To solve real-world issues by developing intelligent computing systems to meet the emerging technology challenges in the industries.\n            2. To apply professional and interpersonal skills through lifelong learning such as advanced degrees and research.\n            3. To participate in collaborative learning and become successful entrepreneurs by ensuring ethical and moral values.\n    Program Outcomes (POs)\n        Engineering Graduates will be able to:\n            1. Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.\n            2. Problem analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences.\n            3. Design/development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.\n            4. Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of theinformation to provide valid conclusions.\n            5. Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.\n            6. The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.\n            7. Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.\n            8. Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.\n            9. Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings.\n            10. Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions.\n            11. Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one's own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.\n            12. Life-long learning: Recognize the need for, and have the preparation and ability to engage inindependent and life-long learning in the broadest context of technological change\n    Program Specific Outcome (PSOs)\n        1. Apply the engineering concepts and evolve Artificial Intelligence-based models to solve real-world problems in various domains and deliver solutions with innovative ideas.\n        2. Apply the concepts and algorithms of various learning models for deep analysis of data to provide high-end business decisions for advancement in the data science fields.\n\n\nM.E - Computer Science and Engineering\n    Program Educational Objectives (PEOs)\n        Computer Science and Engineering program will prepare its learners:\n            To understand the foundational and advanced concepts in Computer Science and Engineering to excel in research by adapting to the rapid advances in new emerging technologies\n            To critically analyze the emerging trends and technologies and future issues at multiple levels and propose research oriented solutions\n            To effectively communicate technical information, function effectively on teams\n            To provide innovative solutions to real-world problems of society by following ethical practices\n            To pursue lifelong multidisciplinary learning as professional engineers and scientists\n    Program Outcomes (POs)\n        An ability to independently carry out research / investigations, identify problems and develop solutions to solve practical problems.\n        An ability to write and present a substantial technical report/ document.\n        Students should be able to demonstrate a degree of mastery in the field of Computer Science and Engineering\n        Use research based knowledge, methods,appropriate techniques, resources and tools to solve complex engineering issues with an understanding of the limitations.\n        An ability to function effectively by applying technical knowledge, ethical practices as an individual and a team member in the career.\n        Recognize the need for independent, life-long learning and engage in the broadest context of technological change.\n    Program Specific Outcomes (PSOs)\n        Graduates will gain advance-level competency and skills in core and emerging technologies of Computer Science and Engineering.\n        Graduates will develop viable solutions to real-world problems through continuous learning and research skills\n",
    "keywords": "departments computer-science-and-engineering profile"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=academics",
    "content": "\nAcademics\n    Courses offered by the department\n        B.E - Computer Science and Engineering\n        B.Tech. - Artificial Intelligence and Data Science\n        M.E - Computer Science and Engineering\n        Ph.D Computer Science and Engineering\n\nB.E - Computer Science and Engineering:\n    This undergraduate course duration is four years(8 semesters). Thiscourse offers a set of theory and practical courses that shall be categorized as Humanities and Social Sciences, Basic Sciences, Engineering Sciences, Professional Core, Professional Elective, Open Elective, Employability Enhancement Courses.\n\nM.E - Computer Science and Engineering:\n    This postgraduate course duration is two years(4 semesters). This course offers a set of theory and practical courses that shall be categorized as Foundation Courses, Professional Core, Professional Elective, Employability Enhancement Courses.\n\nPh.D:\n    This doctoral research programme is offered as full-time/part-time course of study for the research scholars. The research scholar has to complete minimum credits for the course work. The research scholar has to work on his/her area of research under a supervisor recognized by the anna university.\n",
    "keywords": "computer-science-and-engineering academics"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=people&subMenu=faculty",
    "content": "\nFaculty\n    Professors\n        Dr. R. Anitha,  M.E., Ph.D,  Head of the Department\n        Dr. J. M. Gnanasekar, M.E., Ph.D,   AHoD\n        Dr. P. Janarthanan, M.E., Ph.D   \n        Dr. R. Jayabhaduri, M.E., Ph.D   \n        Dr. N. M. Balamurugan, M.E., Ph.D   \n\n    Associate Professors\n        Dr. N. Rajganesh, M.E., Ph.D   \n        Dr. N. Revathi M.E., Ph.D\n        Dr. P. Vinothiyalakshmi, M.E., Ph.D\n        Dr. T. Rajasekaran, M.E., Ph.D\n        Dr. V. Rajalakshmi, M.E., Ph.D\n        Dr. T. Padmavathy M.E., Ph.D   \n        Dr. S. Rajalakshmi, M.E.,Ph.D   \n        Mr. M. Suresh Kumar, M.E.,(Ph.D),  \n\n    Assistant Professors\n        Mr. K. Srinivasan, M.E.,(Ph.D),  \n        Ms. G.Janakasudha, M.E.,(Ph.D),  \n        Ms. R Gayathri, M.E.,(Ph.D),  \n        Ms. J. Buvana, M.E.,(Ph.D),  \n        Mr. A.Sowmya Narayanan, M.E\n        Ms. S. Poorani , M.E.,(Ph.D),  \n        Dr. S. Senthamizh Selvi , M.E., Ph.D,  \n        Ms. R. Iyswarya, M.E.,(Ph.D),  \n        Mr. R. Senthil Kumar, M.Tech.,(Ph.D),  \n        Mr. P. Selvamani, M.E.,(Ph.D),  \n        Dr. M. S. Girija, M.E., Ph.D\n        Ms. V. Radha, M.E.,(Ph.D),  \n        Ms. G. R. Khanaghavalle, M.E.,(Ph.D),  \n        Ms. Rupa Kesavan, M.E.,(Ph.D),  \n        Dr. P. Geetha, M.E., Ph.D\n        Ms. R. K. Kapilavani, M.E.,(Ph.D),  \n        Ms. T. Padmavathy, M.E.,(Ph.D),  \n        Ms. S. Janani, M.E\n        Ms. S. Yuvaprabha, M.E\n        Ms. E. Kiruthiga, M.E\n        Dr. S.D. Nandakumar, M.E., Ph.D   \n        Ms. P. Uma, M.E\n        Ms. Shobhanjaly P. Nair, M.E.,(Ph.D),  \n        Mr. M. Lakshmanan, M.E.,(Ph.D),  \n        Ms. R. Poorni, M.E.,(Ph.D),  \n        Ms. A. Ajoe Sweetlin Jeena, M.E\n        Ms. P. Kaviya , M.E\n        Mr. R. Gnanavel, M.E.,(Ph.D),  \n        Ms. M. Shanthalakshmi, M.E.,(Ph.D),\n        Mr. P. Murugan M.E.,\n        Mr. G. Ilamurugan M.E.,\n        Ms. S. Dhivya M.E.,(Ph.D),\n        Mr. V. Krishnamoorthy M.E.,(Ph.D),\n        Mrs. P.S. Apirajitha M.E.,(Ph.D),\n        Mrs. S. Keerthana M.E.,(Ph.D),\n        Mrs. N. Deepika M.Tech., (Ph.D),\n        Ms. R. Aiyswariya Devi B.Tech., M.E. (Ph.D),\n        Ms. S. Deeparani M.E.    \n",
    "keywords": ""
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=facilities",
    "content": "\nFacilities\n    The department has well equipped laboratory facilities. Students and Faculty utilize these resources for academic practical course, projects and research work.\n        Operating Systems Laboratory\n        Database Laboratory\n        Cloud Computing Laboratory\n        Microprocessor Laboratory\n        Artificial Intelligence Laboratory\n        Software Engineering Laboratory\n        Machine Intelligence Laboratory\n        Data Analytics Laboratory\n        Data Science Laboratory\n    Research Facilities\n        Centre for Intelligent Computing\n        Centre for Language Processing\n        Centre for Deep Learning\n        Research Cell    \n",
    "keywords": "computer-science-and-engineering facilities"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=facilities&subMenu=laboratories",
    "content": "\nLaboratories\n    Operating Systems Lab\n        The Operating Systems laboratory aims at providing the environment to familiarize with the Fedora - LINUX based operating system and Windows Operating System. The Students learn and implement the concepts of OS like Process Management and Scheduling, Process Synchronization and Deadlock, Memory Management, File Allocation and File Organization.The lab is equipped with Server, Desktop Systems, Printer and LCD Projector. The lab is utilized for conducting other Laboratory Courses such as Programming for Problem Solving, Data Structures Lab, Computer Networks Lab and User Interface Lab, and for conducting Technical Events like Workshops, Quiz and Placement Training.\n\n    Database Lab\n        The database laboratory facilitates the conduct of Database Management Systems Lab, Programming and Data Structures lab, Operating Systems lab, Compiler lab and Object Oriented Programming lab. Apart from conducting regular lab sessions, the laboratory facilitates conduct of hands-on workshops, seminars, various coding & design competitions and training for students and faculty of the department.This lab is fully air conditioned and equipped with 40 desktop computers with the required software, LCD Projector with screen, a printer and UPS (3 nos.). The lab also has an Intel Xeon W2102 2.9GHz, Nvidia GeForce RTX 2080 Ti 11 GB GPU workstation, which can be used for carrying out projects and research work in areas like Image and Video processing, computer vision, data analytics, big data etc.\n\n    Cloud Computing Lab\n        Cloud Computing Lab is utilized by UG and PG students for the following purpose\n            1. Development of Mobile applications using Android Studio\n            2. Artificial Intelligence and Machine Learning\n            3. Cloud Computing Lab\n            4. Mini Project\n            5. Project Work (UG and PG)\n\n    Microprocessor Lab\n        This lab caters to the undergraduate students to learn the basic concepts of digital hardware, memory and provide software oriented approach for designing digital systems.\n        This lab has a facility to perform assembly language programming in 8-bit, 16bit microprocessor and microcontroller systems. Also, we have hardware interfaces to simulate and check real time applications using microprocessor\n\n    Artificial Intelligence Lab\n        This lab has high configuration systems to aid in experimenting Machine Learning and Artificial Intelligence projects and thus supporting Artificial Intelligence Lab\n\n    Software Engineering Lab\n        The Software Engineering Lab-A and Lab-B are two adjoining rooms equipped with state-of-the-art hardware and software. All the systems in the lab are installed with Fedora as well as Microsoft Windows Operating System. The Students learn and implement the concepts of Software Engineering using the open source UML tools like Argo UML and Star UML for designing and modelling activities.The lab is equipped with Desktop Systems and LCD Projector. The lab is utilized for conducting other Laboratory Courses such as Programming for Problem Solving, Data Structures Lab, Security lab and User Interface Lab, and for conducting various technical events.\n\n    Machine Intelligence Lab\n        The Machine Intelligence Laboratory provides a synergistic environment dedicated to the study and development of intelligent, autonomous systems. It aims in designing intelligent algorithms which automate problems of data analysis, planning and decision making.The faculty and students associated with the laboratory conduct research in the theory and realization of machine intelligence covering topics such as machine learning, real-time computer vision, statistical modelling, computational intelligence, pattern analysis and neural networks.\n\n    Data Analytics Lab\n        Data Analytics Laboratory focuses on developing algorithms to extract useful information from huge amount of raw data. This lab would cater to students, members of faculty, and staff. The lab mainly houses software tools for various disciplines in Data Analytics such as Health Care, Finance,Speech, Vision and Text.\n\n    Data Science Lab\n        The Data Science Lab focuses on applying machine learning, data mining, and network analysis to real-world societal and industrial problems. To handle the computational demands of data analysis tasks, this laboratory is outfitted with high-performance computing systems, such as servers with powerful processors, large amounts of memory, and fast storage. This laboratory offers a comprehensive suite of software tools designed specifically for data science tasks. Additionally, it offers specialized tools for data manipulation, visualization, machine learning, and deep learning, such as TensorFlow, scikit-learn, PyTorch, and Tableau.\n\n    Centre for Deep Learning\n        The Center for Deep Learning aims at providing the environment to facilitate the research activities in thrust areas like Image processing, Video, Speech and Audio processing, Healthcare Analytics and Cloud-computing.The high-Performance GPU “NVIDIA RTX 2080” is equipped with requisite AI Tensor cores and higher memory bandwidth is very useful in modelling and training Neural Network with large datasets. Students & researchers are getting an amazing opportunity to carry out their research work on any of the following interdisciplinary domain: Computer Vision, Data Analytics, Natural-Language-Processing, Image-processing, Data-Visualization, Web Mining, Information Retrieval, Network Security, Game playing, Statistics, Robotics, Social Networking etc. This facility is also used for conducting training, workshop and seminars for faculty members and the students.\n\n    Centre for Intelligent Computing\n        The Centre for Intelligent Computing was established in 2018 to accelerate R&D activities in the field of Cloud Computing, Cyber Security and IoT. Funded by DST-SERB. Centre for Cloud computing aims at bringing in innovative ideas in the thrust areas of Cloud Computing, Cyber security, Automation Testing and Internet of Things.\n\n    Centre for Language Processing\n        Centre for Language Processing aims at bringing in innovative ideas in the thrust areas of Language processing, Speech Processing and Image Processing. The centre supports the faculty members who are actively pursuing research in thrust areas of Speech Processing, Text Mining, Computational Linguistics, Image Processing. The infrastructure support is provided to the researchers for pursuing their research and consultancy activities.\n\n    Research Cell\n        The Research Cell promotes and coordinates various research activities in the Department. It offers a great platform for academicians,researchers, students, subject experts and aims to enhance the research proportion of faculty and students. It is also responsible for encouraging students to participate in international/national conferences and to publish their research work in reputed journals.\n",
    "keywords": "computer-science-and-engineering facilities laboratories"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=facilities&subMenu=dept--library",
    "content": "\nDept. Library\n    The Department Library of Computer Science and Engineering, gives a great resources and good ambience to the faculty,staff and students to enrich their knowledge. The Department Library has 1674 volumes to keep student and faculty abreasts of developments in research. The library resources are constantly being expanded by adding some amount of books in each semester. The library is air conditioned, spacious enough and designed to be a quiet environment for the readers. Library open from 8.30am to 4.30pm.\n",
    "keywords": "computer-science-and-engineering facilities dept-library"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=students-achievements",
    "content": "\nStudents Achievements\n    Students are encouraged to paricipate in national and international level competitions like hackathon, coding competition, design projects, quiz etc., Students participate in National and International conferences and publish their research work in reputed National and International Journals. Students won many prizes by participating in extra curricular activities like sports, music, dance, acting, photography, gaming etc., They secured University rank for their academic performance.    \n",
    "keywords": "computer-science-and-engineering students-achievements"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=placements",
    "content": "\nPlacements (2022-2023)\n    Placement Co-ordinators\n        Mr. Suresh kumar. M\n        Dr. Rajasekaran. T\n        Mr. Lakshmanan .M\n        Ms. Kaviya .P    \n",
    "keywords": "computer-science-and-engineering placements"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=research",
    "content": "\nResearch\n    The Department has been recognized as a Research Centre during 2010 by Anna University. Thr Department has five recognized supervisor. The Department of Computer Science and Engineering has completed 3 funded projects under DRDO. Currently two projects, one under DST-SERB for an amount of Rupees 21 Lakh and another project based on Natural Language Processing funded by AICTE under Research Promotion Scheme are under ongoing stage.\n    Students and Faculty are actively involved in research. They have received intra-mural funds to carry out their research work.Students are encouraged and mentored to compete for awards such as Tamil Nadu State Council for Science and Technology, Indian National Academy of Engineering and so on.\n    The Department has Artificial Intelligece and Data Science laboratory to carry out research work in major thrust areas.These research labs focuses on developing and nurturing new ideas in the field of Artificial Intelligence. The lab is mainly intended to develop library files and test beds that could be plugged in and used by the various researchers for their experimentation. In addition, this lab will have a higher end cluster for parallelization. Researchers and students will work together and improve their knowledge, intellectual skills by the innovative ideas and guidance given by the Senior Professors.    \n",
    "keywords": "computer-science-and-engineering research"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=research&subMenu=research-activities",
    "content": "\nResearch Activities\n    Research centre status of the department: Recognized as a research centre on 28 January 2010. Recognition renewed up to December 2024.\n    Number of faculty in the Department : 51\n    Number of faculty with Ph D qualification : 17\n    Number of faculty pursuing Ph D : 13 (SVCE research centre - AU) +12 (External)\n    Number of supervisors: 6\n    Number of research scholars (FT/PT) in the department research centre: 18    \n",
    "keywords": "computer-science-and-engineering research research-activities"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=technical-associations",
    "content": "\nTechnical Associations\n    Encourage student's leadership activity by organizing National Level Technical symposium INTERRUPT every year through Association of Computer Engineers (ACE) student forum and other professional bodies like Computer Society of India.\n    Technical Associations in the department\n        Association of Computer Engineers\n        Association of Computing Machinery\n        Computer Society of India\n        Know I Club\n        Compete to Compute\n        CYBER-HUB    \n",
    "keywords": "computer-science-and-engineering technical-associations"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=technical-associations&subMenu=ace",
    "content": "\nAssociation of Computer Engineers(ACE)\n    “A LITTLE PROGRESS EVERYDAY, ADDS UP TO BIG RESULTS!!!”\n    ACE is the birth place of many innovators, who have brought laurels to the department, in turn to the college. It is proud, happy and noteworthy that ACE has crossed two decades from its inception. ACE plays a significant role as an adjunct to the course work.\n    ACE – a place where a student discovers his hidden talents, gets rid of all sorts of inhibitions, sets up and creates a new history every year. ACE strives for the synchronization between academic learning and recent development in the technology and industry.\n    ACE is run by the students and for the students to nurture their creativity and wholesome personality.\n    ACE extracts the best out of every student, because of the laudable efforts by the students under the able guidance of the faculty and staff. ACE provides avenues for developing technical skills, updating knowledge on the state of the art subjects, enhancing personality & service to the department and of course to the computer society.\n    The activities undertaken by ACE are conducting seminars & workshops, special lectures by eminent speakers, paper presentations, quiz, debates, intra department contests & imparting practical skills.\n    Apart from these activities, ACE under takes INTERRUPT and INNOVATION DAY.\n        INTERRUPT – We all know our departmental technical symposium. It’s a grand hit that spreads ACE’s fame amidst students from others colleges.\n        INNOVATION DAY – a celebration of our ability to get new ideas, indulges imagination to make new decisions, to make ourselves better and to make our place in the world better too.\n",
    "keywords": "computer-science-and-engineering technical-associations ace"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=technical-associations&subMenu=acm",
    "content": "\nACM\n    Association of Computing Machinery, Student Chapter\n        SVCE ACM Student Chapter was set up by students of CSE department under the guidance of ACM Student Chapter faculty coordinator. It was officially chartered by ACM New York on 26th August 2011. ACM is an international organization whose aim is \"Advancing computing as a science and profession\". A team of 26 enthusiastic students from the Department took the initiative to set up this chapter. The official launch was on 22nd September 2011. SVCE ACM student chapter was set up to facilitate all activities which aim at spreading quality computing education by setting up learning groups, organizing seminars, conducting workshops, facilitating contests and so on.\n\n    ACM-SVCE STUDENTS CHAPTER\n        The SVCE ACM student chapter aims to provide an opportunity for students from different walks of life to compete and tackle problems in an effective manner. As one of the well-known institutions inside the college, we aim to bolster student skills from both a professional and personal point of view by organising events like Hackathons, workshops and quizzes. As we set foot into our seventh successful year, we aim to maintain the high standards set by our predecessors by organising events intertwined with fun and frolic, for we believe in: \"Simplicity, carried to the extreme, becomes elegance\".\n        Organizing technical events intertwined with loads of fun filled challenges is our forte. Our wide variety of events boosts both 'competing by learning' as well as 'learning by competing'! Participating in our events helps you take a step towards success, and thereby guides you to make your path towards success an interesting one rather than a difficult one.\n\n    ACADEMIC YEAR 2022 - 2023\n        Coordinator : Dr. R. Anitha, Professor & Head/CSE\n        Co-coordinator: Mr. T. Rajasekaran, AP/CSE\n",
    "keywords": "computer-science-and-engineering technical-associations acm"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=technical-associations&subMenu=know-i",
    "content": "\nKnow-I\n    Know-I Research Club\n        Know-I research forum aims at imparting and enhancing knowledge in the field of Artificial Intelligence, Machine learning, Deep learning, and Computer vision for the students of Sri Venkateswara College of Engineering. One of the priorities is to encourage students to get involved in research-based activities. To achieve this, the forum has an exuberant team consisting of faculty and students to organize competitions, workshops, project presentations, etc. The club acts as a platform for the students, faculty, and industry experts to share their experiences and work collaboratively to provide intelligent solutions for real-world problems.\n\n    ACADEMIC YEAR 2022 - 2023\n        Coordinator : Ms.T.Padmavathy ,AP/CSE\n        Co-coordinator: Ms.V.Radha , AP/CSE\n",
    "keywords": "computer-science-and-engineering technical-associations know-i"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=technical-associations&subMenu=ccc",
    "content": "\nCompete to Compute Club -CCC\n    Objective of the club is to providing the necessary skills and confidence to face the industrial environment without any fear and conquer their wildest dreams in the upcoming future.\n\n    Faculty Incharge\n        Dr. P. Vinothiyalakshmi, Assistant Professor/CSE\n        Mr. P. Selvamani, Assistant Professor/CSE    \n",
    "keywords": "computer-science-and-engineering technical-associations ccc"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=technical-associations&subMenu=cyber-hub",
    "content": "\nSVCE Cyber Hub\n    “It takes 20 years to build a reputation and few a seconds of cyber-incident to destroy it.”\n    SVCE Cyber Hub is run by students to bits of helping fellow students in order to foster their creativity and overall well-being. We Intend to support students who are interested in and committed to pursuing careers in the field of cyber security and networking. We arrange various technical events and provide resources that assist students to learn about these disciplines conceptually and practically. We also provide webinars, seminars, hands-on sessions, and other few events so that students may have practical experience with what they have studied theoretically.    \n    \n    Academic Year 2022 - 2023\n        Coordinator: Mr. M. Suresh Kumar, AP/CSE\n        Co-coordinator: Mr. M. Lakshmanan, AP/CSE\n",
    "keywords": "computer-science-and-engineering technical-associations cyber-hub"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=technical-associations&subMenu=iii-cell",
    "content": "\nIII Cell\nINDUSTRY INSTITUTE INTERACTION CELL(IIIC)\n\n    IIIC Coordinator: Mr.T.Rajasekaran\n\n    The Industry Institution Interaction Cell (IIIC) was established with the objective,\n        To bridge the gap between the industry and the academia.\n        To Evolve educational programmes which are consistent with the broad requirements of the industry and which can give rise to engineering personnel capable of coping-up with the accelerating pace of the technological development.\n        To create adequate facilities of updating knowledge of professional engineers and technologists to meet growth and developmental needs of the industry.\n        To coordinate the research and developmental activities of the two systems\n\n    The ultimate goal of this relationship will be the creation of confidence in industry by the institute and vice versa, which would results in industry involving in various stages of institutional development such as\n        Participation of Industrial expertise in curriculum reorientation\n        Exchange of experts between industry and institute\n        Institute as a consultant in R&D.\n        Establishment of linkage (MoU) and so on.    \n",
    "keywords": "computer-science-and-engineering technical-associations iii-cell"
  },
  {
    "url": "https://www.svce.ac.in/departments/computer-science-and-engineering/?page=newsletter",
    "content": "\nNewsletter\n    The Newsletter ‘CSE - BYTES’ is a forum to expose the events, happenings, and achievements in the department as well as provide a platform to exhibit the talents of the budding engineers and the faculty as well. This newsletter will definitely create an impact in the minds of readers by providing a wider visibility and new dimension to the learning community. Also, the Magazine ‘E-Yatra’ helps in building up teamwork among the students, which is very much important in this competitive world. It provides the opportunity to bring out the talents of young budding engineers as per their wish.\n",
    "keywords": "computer-science-and-engineering newsletter"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4327",
    "content": "\nName\tDr. R. Anitha\nDesignation\tProfessor & Head of the Department\nAreas of Interest\tCloud Computing,Data Mining, Large Scale Database, Data Structures and Algorithms & Big Data Analytics\nRoom No.\t5008\nIntercom No.\t044-27152000 / 300\nMobile\t9952337212\nEmail Id (Official)\thodcs@svce.ac.in\nEmail Id (Personal)\tanitabalajim@gmail.com\n",
    "keywords": "profile computer-science-and-engineering anitha"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4796",
    "content": "\nName\tDr. J.M.Gnanasekar\nDesignation\tProfessor\nAreas of Interest\tWeb Technology,Cloud Computing,Service Oriented Computing\nRoom No.\t5106\nIntercom No.\t304\nMobile\t9444508360\nEmail Id (Official)\tjmg@svce.ac.in\n",
    "keywords": "profile computer-science-and-engineering gnanasekar"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4946",
    "content": "\nName\tDr. P. Janarthanan\nDesignation\tProfessor\nAreas of Interest\tInformation Retrieval, Data Mining and Knowledge Management.\nRoom No.\t5115\nIntercom No.\t311\nMobile\t9443087791\nEmail Id (Official)\tjanap@svce.ac.in\nEmail Id (Personal)\tjana.mca.me@gmail.com\n",
    "keywords": "profile computer-science-and-engineering janarthanan"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4987",
    "content": "\nName\tDr. R. Jayabhaduri\nDesignation\tProfessor\nAreas of Interest\tArtificial Intelligence, Bioinspired Computing, Machine Learning, Big Data Analytics, Data Analytics and Business Intelligence\nRoom No.\t5114\nIntercom No.\t311\nEmail Id (Official)\tjaya@svce.ac.in\n",
    "keywords": "profile computer-science-and-engineering jayabhaduri"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5098",
    "content": "\nName\tDr. N. M. Balamurugan\nDesignation\tProfessor\nAreas of Interest\tArtificial Intelligence, Machine Learning, Intelligent Networks,Internet-of-Things\nRoom No.\t5204\nIntercom No.\t313\nEmail Id (Official)\tbalgan@svce.ac.in\nEmail Id (Personal)\tnmbalgan@gmail.com\n",
    "keywords": "profile computer-science-and-engineering balamurugan"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=11803",
    "content": "\nName\tDr. N.Rajganesh\nDesignation\tAssociate Professor\nAreas of Interest\tSOA, Cloud Computing, AI\nRoom No.\t5205\nIntercom No.\t313\nMobile\t+91 8838439115\nEmail Id (Official)\trajganeshn@svce.ac.in\nEmail Id (Personal)\tanuvarajganesh@gmail.com\n",
    "keywords": "profile computer-science-and-engineering rajganesh"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4841",
    "content": "\nName\tDr. Revathi N\nDesignation\tAssociate Professor\nAreas of Interest\tDistributed Systems,Design and analysis of parallel algorithms,Service Oriented Architecture,Cloud Computing\nRoom No.\t5106\nIntercom No.\t301\nEmail Id (Official)\trevathi@svce.ac.in\n",
    "keywords": "profile computer-science-and-engineering revathi"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5103",
    "content": "\nName\tDr. P. Vinothiyalakshmi\nDesignation\tAssociate Professor\nAreas of Interest\tCloud Computing, Internet of Things (IoT), Machine Learning, Data Structures, OOPS, Operating System, Computer Networks, Data Mining\nRoom No.\t5105\nIntercom No.\t314\nEmail Id (Official)\tvlakshmi@svce.ac.in\n",
    "keywords": "profile computer-science-and-engineering vinothiyalakshmi"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5176",
    "content": "\nName\tDr. Rajasekaran T\nDesignation\tAssociate Professor\nAreas of Interest\tNetworking, Vehicular Adhoc Network (VANET), Software Testing, Internet of Things\nRoom No.\t5213\nIntercom No.\t310\nMobile\t9994481899\nEmail Id (Official)\trajasekaran@svce.ac.in\nEmail Id (Personal)\traja5891.t@gmail.com\n",
    "keywords": "profile computer-science-and-engineering rajasekaran"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4929",
    "content": "\nName\tDr. V. Rajalakshmi\nDesignation\tAssociate Professor\nAreas of Interest\tData Structures & Algorithms,Operating System,Compiler Design,Smart Environments,Machine Learning\nRoom No.\t5103\nIntercom No.\t314\nMobile\t9176999190\nEmail Id (Official)\tvraji@svce.ac.in\nEmail Id (Personal)\tvraji1983@gmail.com\n",
    "keywords": "profile computer-science-and-engineering rajalakshmi"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5063",
    "content": "\nName\tDr. Padmavathy. T\nDesignation\tAssociate Professor\nAreas of Interest\tData Structures,Algorithms,OOPS,Programming languages\nRoom No.\t5010\nIntercom No.\t301\nMobile\t9940980585\nEmail Id (Official)\ttpadma@svce.ac.in\nEmail Id (Personal)\tpadmavathy.thiruppathiraj@gmail.com\n",
    "keywords": "profile computer-science-and-engineering padmavathy"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5123",
    "content": "\nName\tDr. S. Rajalakshmi\nDesignation\tAssociate Professor\nAreas of Interest\tOPERATIONS RESEARCH,SYSTEMS ENGINEERING,OPERATING SYSTEMS,CRYPTOGRAPHY & NETWORK SECURITY,DATA STRUCTURES & ALGORITHMS,FREQUENT ITEMSET MIING & GRAPH THEORY,RECOMMENDATION SYSTEMS, GRAPH THEORY AND OPERATIONS RESEARCH\nRoom No.\t5003\nIntercom No.\t301\nMobile\t9047560110\nEmail Id (Official)\tsraji@svce.ac.in\nEmail Id (Personal)\trajiaslakshmi@gmail.com\n",
    "keywords": "profile computer-science-and-engineering rajalakshmi"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5174",
    "content": "\nName\tMr. M. Suresh Kumar\nDesignation\tAssociate Professor\nAreas of Interest\tWireless Networks\t\nIntercom No.\t310\nMobile\t9994526625\nEmail Id (Official)\tsureshm@svce.ac.in\nEmail Id (Personal)\tbabumrm@gmail.com\n",
    "keywords": "profile computer-science-and-engineering suresh-kumar"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4896",
    "content": "\nName\tMr. K.Srinivasan\nDesignation\tAssistant Professor\nAreas of Interest\tCloud Computing, Wireless networks, Web technologies, Ethical Hacking\nEmail Id (Official)\tksrinivasan@svce.ac.in\n",
    "keywords": "profile computer-science-and-engineering srinivasan"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4955",
    "content": "\nName\tMs.G.Janakasudha\nDesignation\tAssistant Professor\nAreas of Interest\tProgramming for Problem solving, Programming and Data Structures,Design and Analysis of Algorithms,Theory of Computation, Compiler Design, Artificial Intelligence, Machine Learning, Deep Learning, Computer Vision and Data analytics\nRoom No.\t5214\nIntercom No.\t310\nEmail Id (Official)\tjsudha@svce.ac.in\n",
    "keywords": "profile computer-science-and-engineering janakasudha"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=4985",
    "content": "\nName\tMs.R.Gayathri\nDesignation\tAssistant Professor\nAreas of Interest\tMachine Learning,Data Analytics\nIntercom No.\t314\nMobile\t9894802344\nEmail Id (Official)\tgayathri@svce.ac.in\nEmail Id (Personal)\tgayathri2.r@gmail.com\n",
    "keywords": "profile computer-science-and-engineering gayathri"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5147",
    "content": "\nName\tMs. J. Buvana\nDesignation\tAssistant Professor\nAreas of Interest\tCryptography and Network Security ,Blockchain\nRoom No.\t5005\nIntercom No.\t301\nMobile\t9597932530\nEmail Id (Official)\tbuvana@svce.ac.in\n",
    "keywords": "profile computer-science-and-engineering buvana"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5162",
    "content": "\nName\tMr. A.Sowmya Narayanan\nDesignation\tAssistant Professor\nAreas of Interest\tDigital Signal Processing, Computer Architecture, Microprocessor, Computer Networks, Data Warehousing and Data Mining\t\nIntercom No.\t314\nEmail Id (Official)\tsowmya@svce.ac.in\n",
    "keywords": "profile computer-science-and-engineering sowmya-narayanan"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5170",
    "content": "\nName\tMs. S Poorani\nDesignation\tAssistant Professor\nAreas of Interest\tWireless Networks,Information Security\nRoom No.\t5010\nIntercom No.\t312\nMobile\t9940640691\nEmail Id (Official)\tspoorani@svce.ac.in\nEmail Id (Personal)\tpoorani703@gmail.com\n",
    "keywords": "profile computer-science-and-engineering poorani"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5206",
    "content": "\nName\tDr. S. Senthamizh Selvi\nDesignation\tAssistant Professor\nAreas of Interest\tNatural Language Processing, Machine Learning & Wireless Adhoc Networks\nRoom No.\t5207\nIntercom No.\t310\nEmail Id (Official)\tsenthamizhselvi@svce.ac.in\n",
    "keywords": "profile computer-science-and-engineering senthamizh-selvi"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5257",
    "content": "\nName\tMs.R.Iyswarya\nDesignation\tAssistant Professor\nAreas of Interest\tCloud Computing Computer Networks Data analytics\nRoom No.\t5002\nIntercom No.\t301\nMobile\t9629486392\nEmail Id (Official)\tiyswarya@svce.ac.in\nEmail Id (Personal)\tiysworld4@gmail.com\n",
    "keywords": "profile computer-science-and-engineering iyswarya"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5227",
    "content": "\nName\tMr. R. Senthil Kumar\nDesignation\tAssistant Professor\nAreas of Interest\tComputer Networks,Cloud Computing\t\nIntercom No.\t311\nEmail Id (Official)\tsenthilkumar_r@svce.ac.in\n",
    "keywords": "profile computer-science-and-engineering senthil-kumar"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=5165",
    "content": "\nName\tMr. P. Selvamani\nDesignation\tAssistant Professor\nAreas of Interest\tCloud Computing , Edge Computing , Compiler Design, Data Analytics, IoT.\nRoom No.\t5212\nIntercom No.\t310\nMobile\t9789592509\nEmail Id (Official)\tpselvamani@svce.ac.in\nEmail Id (Personal)\tmvpselva84@gmail.com\n",
    "keywords": "profile computer-science-and-engineering selvamani"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=9716",
    "content": "\nName\tDr. M.S.Girija\nDesignation\tAssistant Professor\nAreas of Interest\tWireless Sensor Networks , Machine Learning, Graph Theory.\nRoom No.\t5005\nIntercom No.\t301\nMobile\t044-27152000 ext 301\nEmail Id (Official)\tgirijamagesh@svce.ac.in\n",
    "keywords": "profile computer-science-and-engineering girija"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=10853",
    "content": "\nName\tMs.V.Radha\nDesignation\tAssistant Professor\nAreas of Interest\tNetworks Security ,Edge Cloud Computing.\nRoom No.\t5214\nIntercom No.\t310 \nEmail Id (Official)\tradhav@svce.ac.in\nEmail Id (Personal)\tradha90r@gmail.com\n",
    "keywords": "profile computer-science-and-engineering radha"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=10855",
    "content": "\nName\tMs. G. R. Khanaghavalle\nDesignation\tAssistant Professor\nAreas of Interest\tComputer Networks, Data Structures, Machine Learning\nRoom No.\t5103\nIntercom No.\t314\nMobile\t8870688044\nEmail Id (Official)\tkhanaghavalle@svce.ac.in\nEmail Id (Personal)\tkhanaghavalle@gmail.com\n",
    "keywords": "profile computer-science-and-engineering khanaghavalle"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=10874",
    "content": "\nName\tMs. Rupa Kesavan\nDesignation\tAssistant Professor\nAreas of Interest\tData Structures , Design and Analysis of Algorithms, Machine Learning , Mobile Computing , Data Analytics\nRoom No.\t5211\nIntercom No.\t313\nMobile\t9176516422, 9884298051\nEmail Id (Official)\trupakesavan@svce.ac.in\nEmail Id (Personal)\trupakesavan.cse@gmail.com\n",
    "keywords": "profile computer-science-and-engineering rupa-kesavan"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=11805",
    "content": "\nName\tDr. P .Geetha\nDesignation\tAssistant Professor\nAreas of Interest\tCloud Computing, Data Sciences, Compiler Design Techniques\nRoom No.\t\nIntercom No.\t313\nMobile\t9788515775\nEmail Id (Official)\tgeethaperumal@svce.ac.in\nEmail Id (Personal)\tgeethaperu@gmail.com\n",
    "keywords": "profile computer-science-and-engineering geetha"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=11806",
    "content": "\nName\tMs.R.K.Kapilavani\nDesignation\tAssistant Professor\nAreas of Interest\tMachine Learning, Artificial Intelligence, E-Learning\nRoom No.\t5208\nIntercom No.\t310\nMobile\t9941112928\nEmail Id (Official)\trkkapilavani@svce.ac.in\nEmail Id (Personal)\tkapilavani@gmail.com\n",
    "keywords": "profile computer-science-and-engineering kapilavani"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=13927",
    "content": "\nName\tMs.T.Padmavathy\nDesignation\tAssistant Professor\nAreas of Interest\tDatabase Management System,Operating System\nRoom No.\t5003\nIntercom No.\t301\nEmail Id (Official)\tpadmavathy@svce.ac.in\nEmail Id (Personal)\tPadhu29@gmail.com\n",
    "keywords": "profile computer-science-and-engineering padmavathy"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=14692",
    "content": "\nName\tMs.S.Janani\nDesignation\tAssistant Professor\nAreas of Interest\tNetworks,Object Oriented Programming,Object Oriented Analysis and Design\nRoom No.\t5011\nIntercom No.\t301\nMobile\t9677741326\nEmail Id (Official)\tsjanani@svce.ac.in\nEmail Id (Personal)\tjananisivapat@gmail.com\n",
    "keywords": "profile computer-science-and-engineering janani"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=15363",
    "content": "\nName\tMs.Yuvaprabha S\nDesignation\tAssistant Professor\nAreas of Interest\tDatabase Management System, Software Engineering, Software Testing and Quality Assurance\nRoom No.\t5206\nIntercom No.\t313\nEmail Id (Official)\tyuvaprabhas@svce.ac.in\n",
    "keywords": "profile computer-science-and-engineering yuvaprabha"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=15365",
    "content": "\nName\tMs.E.Kiruthiga\nDesignation\tAssistant Professor\nAreas of Interest\tDatabase management System, User Interface, Software Engineering, Software Testing\nRoom No.\t5206\nIntercom No.\t313\nEmail Id (Official)\tkiruthigae@svce.ac.in\nEmail Id (Personal)\tkiruthigaelango44@gmail.com\n",
    "keywords": "profile computer-science-and-engineering kiruthiga"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=15488",
    "content": "\nName\tDr. S. D. Nandakumar\nDesignation\tAssistant Professor\nAreas of Interest\tTheory of Computation, Wireless Networks, Data\nRoom No.\t5205\nIntercom No.\t313\nMobile\t9952591059, 7904427608\nEmail Id (Official)\tnandakumar@svce.ac.in\nEmail Id (Personal)\tsdnandhu@gmail.com\n",
    "keywords": "profile computer-science-and-engineering nandakumar"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=15492",
    "content": "\nName\tMs. P. Uma\nDesignation\tAssistant Professor\nAreas of Interest\tBig Data, Networking\nRoom No.\t5208\nIntercom No.\t312\nEmail Id (Official)\tumap@svce.ac.in\nEmail Id (Personal)\tuma_perumal2003@yahoo.co.in\n",
    "keywords": "profile computer-science-and-engineering uma"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=15475",
    "content": "\nName\tShobhanjaly P Nair\nDesignation\tAssistant Professor\nAreas of Interest\tBig Data\nRoom No.\t5111\nIntercom No.\t311\nMobile\t9884130381\nEmail Id (Official)\tshobhanjaly@svce.ac.in\nEmail Id (Personal)\tanjaly.cse@gmail.com\n",
    "keywords": "profile computer-science-and-engineering shobhanjaly"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=15479",
    "content": "\nName\tMr. M . Lakshmanan\nDesignation\tAssistant Professor\nAreas of Interest\tBlockchain, Data Structures, Software Testing\nRoom No.\t5213\nIntercom No.\t310\nMobile\t9003778186\nEmail Id (Official)\tlakshmananm@svce.ac.in\nEmail Id (Personal)\tlakshmanan1909@gmail.com\n",
    "keywords": "profile computer-science-and-engineering lakshmanan"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=15490",
    "content": "\nName\tMs. R. Poorni\nDesignation\tAssistant Professor\nAreas of Interest\tObject Oriented Programming, Deep Learning\nRoom No.\t5009\nIntercom No.\t310\nMobile\t8939264958\nEmail Id (Official)\tpoornir@svce.ac.in\nEmail Id (Personal)\tpoorniram21@gmail.com\n",
    "keywords": "profile computer-science-and-engineering poorni"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=15502",
    "content": "\nName\tMs. A. Ajoe Sweetlin Jeena\nDesignation\tAssistant Professor\nAreas of Interest\tIoT,Deep Learning,Cloud Computing.\nRoom No.\t5009\nIntercom No.\t310\nMobile\t9487728640\nEmail Id (Personal)\tcoolajoejeena@gmail.com\n",
    "keywords": "profile computer-science-and-engineering ajoe-sweetlin-jeena"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=15533",
    "content": "\nName\tMs. Kaviya P\nDesignation\tAssistant Professor\nAreas of Interest\tM2M NETWORKING, MACHINE LEARNING\nRoom No.\t5211\nMobile\t9677211723\nEmail Id (Official)\t\nEmail Id (Personal)\tkaviyaperu13@gmail.com\n",
    "keywords": "profile computer-science-and-engineering kaviya"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=15532",
    "content": "\nName\tMr. R. Gnanavel\nDesignation\tAssistant Professor\nAreas of Interest\tCloud Computing, Data Analytics, Networking\t\nMobile\t9688856778\nEmail Id (Official)\tgnanavelr@svce.ac.in\nEmail Id (Personal)\trgvelu22@gmail.com\n",
    "keywords": "profile computer-science-and-engineering gnanavel"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=16132",
    "content": "\nName\tMs. M. Shanthalakshmi\nDesignation\tAssistant Professor\nAreas of Interest\tMachine Learning, Cyber Security\nRoom No.\t5208\nIntercom No.\t310\nMobile\t8667078417\nEmail Id (Official)\tshanthalakshmim@svce.ac.in\nEmail Id (Personal)\tmshanthi.s@gmail.com\n",
    "keywords": "profile computer-science-and-engineering shanthalakshmi"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=17038",
    "content": "\nName\tMr. P. MURUGAN\nDesignation\tAssistant Professor\nAreas of Interest\tMachine Learning, Internet Of Things, Block Chain\nRoom No.\t5113\nIntercom No.\t301\nMobile\t9095324739\nEmail Id (Official)\tmurugan@svce.ac.in\nEmail Id (Personal)\tmurugan3.ramar@gmail.com\n",
    "keywords": "profile computer-science-and-engineering murugan"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=17043",
    "content": "\nName\tMr. G. ILAMURUGAN\nDesignation\tAssistant Professor\nAreas of Interest\tSoftware Engineering, Internet Of Things, Block Chain\nRoom No.\t5212\nIntercom No.\t310\nMobile\t9940447364\nEmail Id (Official)\tilamurugang@svce.ac.in\nEmail Id (Personal)\tilamurugan.cse@gmail.com\n",
    "keywords": "profile computer-science-and-engineering ilamurugan"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=17230",
    "content": "\nName\tS. Dhivya\nDesignation\tAssistant Professor\nAreas of Interest\tImage Processing, Deep Learning, Machine Learning\nRoom No.\t5207\nIntercom No.\t313\nMobile\t9159913247\nEmail Id (Official)\tdhivyas@svce.ac.in\nEmail Id (Personal)\tdhivs37@gmail.com\n",
    "keywords": "profile computer-science-and-engineering dhivya"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=17265",
    "content": "\nName\tMr. V. Krishnamoorthy\nDesignation\tAssistant Professor\nAreas of Interest\tData Mining, Deep Learning\t\nMobile\t9600623481\nEmail Id (Official)\tkrishnamoorthyv@svce.ac.in\nEmail Id (Personal)\tkrishna997@gmailcom\n",
    "keywords": "profile computer-science-and-engineering krishnamoorthy"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=17454",
    "content": "\nName\tMrs. P.S. Apirajitha\nDesignation\tAssistant Professor\nAreas of Interest\tCloud Computing, Compiler Design, Block Chain Technology, Cyber Security and Forensics, Theory of Computation\nRoom No.\t5211\nIntercom No.\t313\nMobile\t8056142067\nEmail Id (Official)\tapirajithaps@svce.ac.in\nEmail Id (Personal)\tapirajitha.s@gmail.com\n",
    "keywords": "profile computer-science-and-engineering apirajitha"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=17452",
    "content": "\nName\tMrs. S. Keerthana\nDesignation\tAssistant Professor\nAreas of Interest\tDeep Learning, Artificial Intelligence, Big Data Analytics, Computer Networks\nRoom No.\t5211\t\nMobile\t9944736860\nEmail Id (Official)\tkeerthanas@svce.ac.in\nEmail Id (Personal)\tkeerthanasrikanth.ks@gmail.com\n",
    "keywords": "profile computer-science-and-engineering keerthana"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=17913",
    "content": "\nName\tMrs. N. Deepika\nDesignation\tAssistant Professor\nAreas of Interest\tDeep Learning, Artificial Intelligence, Computer Vision, Image Processingoom No.\t\nIntercom No.\t313\nMobile\t9003187894\nEmail Id (Official)\tdeepikan@svce.ac.in\nEmail Id (Personal)\tdeepikae89@gmail.com\n",
    "keywords": "profile computer-science-and-engineering deepika"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=18179",
    "content": "\nName\tMs. R. Aiyshwariya Devi\nDesignation\tAssistant Professor\nAreas of Interest\tComputer Science & Engineering\t\nMobile\t7867088235, 9790272045\nEmail Id (Official)\taiyshwariya@svce.ac.in\nEmail Id (Personal)\taiyshwariyadevi@gmail.com\n",
    "keywords": "profile computer-science-and-engineering aiyshwariya-devi"
  },
  {
    "url": "https://www.svce.ac.in/profile-info/?id=18658",
    "content": "\nName\tS. Deeparani\nDesignation\tAssistant professor\nAreas of Interest\tMachine Learning\t\nMobile\t7540070696\nEmail Id (Official)\tdeeparanis@svce.ac.in\nEmail Id (Personal)\tsdeeparanisenthil2@gmail.com\n",
    "keywords": "profile computer-science-and-engineering deeparani"
  },
  {
    "url": "https://www.svce.ac.in/placement/",
    "content": "\nHow Placements Cell Operates in SVCE\n    The Placement cell is one of the important department in SVCE. Knowing that you will be guided after your graduation so that you land a job helps you feel secure. This is the reason why we have a dedicated placement cell that helps, guides, and advises students about the future.\n    In SVCE, students come from all walks of lives. They come from different parts of the country including rural areas. Some individuals may not be aware of how things work. Some others may not be confident enough to walk into an interview even though they are skilled. These problems are more common and our skilled placement panel are helping students to get placed in top companies.\n\nSVCE - Placement Cell\n    The Training and Placement Cell headed by a Senior Professor in the college plays a very active role in getting our students placed in various leading Multi National companies (MNCs) and Indian Companies.\n        Prof. S. Muraleedharan, MS, MBA (Chief Placement Officer)\n        Mr. A. K. Boobalasenthilraj, M.E., (Ph.D.,) (Assistant Placement Officer)\n        Mr. D. Pugazharasu, M.A., MCA., (Junior Assistant)\n\nList of Department Placement Co-ordinators\n    Mr.J.Sivaramapandian M.E., Department of Mechanical Engineering\n    Mr.M.Sureshkumar M.E., Mr. T. Rajasekaran M.E., Department of Computer Science and Engineering\n    Mr. P. Arul M.E., Mr. G. Loganathan M.E., Mr. P. Muthukumaran M.E., Department of Electroncis and Communication Engineering\n    Dr. R. Kannadasan, PhD., Mr. S. Thamizmani M.E., Department of Electrical and Electronics Engineering\n    Mr. Yogesh Kumar M M.Tech., Mr. S. Bharath M.Tech., Department of Chemical Engineering\n    Mr. A.R. Guru Gokul M.E., Mr. K. Suresh M.E., Department of Information Technology\n    Mr. A.K. Boobalasenthilraj M.E., Mr. Ramanjaneyulu Kolla M.E., Department of Automobile Engineering\n    Mr. S. Naga Vignesh M.S., Department of Bio Technology\n    Mr. S. Diraviabalan M.E., Department of Civil Engineering\n    Prof. S. Krishnan, Department of Marine Engineering\n",
    "keywords": "placement placement-cell"
  },
  {
    "url": "https://www.svce.ac.in/placement/?page=training",
    "content": "\nTraining\n    Placement training plays a major role in shaping up the career goals of students. It is the dream of every engineering student to get placed in a top organization visiting their campus for recruitment. Keeping this key aspect into consideration, it is realized that training is important for engineering students to enhance their employability skills and achieve good placement in various Industries.\n        To create awareness about \"career planning\" and \"career mapping\" among the students.\n        To train the students on \"Personality development\".\n        To organize Various Training Programmes to train the students in the areas of Quantitative Aptitude, Logical reasoning and Verbal reasoning.\n        To train the students through Mock Interviews to perform well in the professional interviews as per the Industries expectations.    \n",
    "keywords": "placement training"
  },
  {
    "url": "https://www.svce.ac.in/placement/?page=training&subMenu=higher-studies",
    "content": "\nHigher Studies\n    Sri Venkateswara College of Engineering emphasis on the career counseling for the final year engineering students by training and preparing the students for pursuing higher studies in abroad or in India. Centre for higher education is formed exclusively for motivating, counseling and guiding the students to pursue higher studies.\n    The higher studies centre identifies the students who are showing interest for Higher Studies. Accordingly, the Department arranges 'Guidance' through Lectures by eminent personalities to assist the students in making their right choice regarding the Subjects, Courses and Universities for Higher Studies, both in India and abroad. This is a well structured Support System for pursuing Higher Studies.\n    The few list of University which is providing opportunity to our students:    \n        Princeton University (Princeton, NJ)\n        Harvard University (Cambridge, MA)\n        Columbia University (New York, NY)\n        Massachusetts Institute of Technology (Cambridge, MA)\n        Yale University (New Haven, CT)\n        Stanford University (Stanford, CA)\n        University of Chicago (Chicago, IL)\n        Northwestern University (Evanston, IL)\n        Duke University (Durham, NC)\n        California Institute of Technology (Pasadena, CA)\n        University of Oxford, Oxford\n        University of Cambridge, Cambridge\n        University of Manchester, Manchester\n        University of York, York\n        Durham University, Durham\n        University of Exeter, Exeter\n        University of Sussex, Sussex\n        University of Leeds, Leeds\n        University of St Andrews, St Andrews\n        University of Essex, Essex\n        University of California\n        University of Southern California\n        Southern Methodist University ( Dallas,TX )\n        RIT:Rochester Institute of Technology ( Rochester,NY)\n        University of Texas\n        University of Pennsylvania (Philadelphia,PA)\n        Hofstra University ( Hempstead,NY)\n        St.John’s University (Queens,NY)\n        Middlesex University, UK\n        Management Development Institute of Singapore (MDIS)\n        PSB Academy, Singapore\n        Asia Pacific University College of Technology & Innovation, Malaysia\n        Douglas College, Canada\n        Kansas State University, USA\n        Bond University, Australia\n        University of Melbourne\n        City University of London\n        University of Sydney\n",
    "keywords": "placement training higher-studies"
  },
  {
    "url": "https://www.svce.ac.in/placement/?page=training&subMenu=internship",
    "content": "\nInternship\n    Internships provide exposure for students to gain experience in selected domain and observe the best practices that are currently being followed in industries. Sri Venkateswara College of Engineering allows internship to be taken by students from their second semester. These opportunities are provided by the Placement Section as part of campus recruitment. Students are available from May to July (Summer Intern) & December to Janury (Winter Intern) for taking internships. Students take up internships in core, IT and ITES companies. The internships at companies will give value addition to the students community to make them ready to taking real world challenges when they take up full time employment.\n",
    "keywords": "placement training internship"
  },
  {
    "url": "https://www.svce.ac.in/placement/?page=training&subMenu=train-the-trainer",
    "content": "\nTrain the Trainer\n    The Train the Trainer model is a training strategy used at Sri Venkateswara College of Engineering. The trainer, a subject-matter expert, trains our SVCE faculties.\n    List of few initiative to train our SVCE faculties:\n        Wipro Talent Next Program provides a learning platform to SVCE faculties\n        INFOSYS provides “Train the Trainers” programme at their Campusin which the SVCE faculties were trained in recent Technologies\n        Infosys Campus Connect - Faculty Enablement Program\n        Cognizant - FDP on Augmented Reality at Cognizant MEPZ, Chennai\n        ZoomRx – Data Analytics\n        TAFE provides a training in Tractor   \n",
    "keywords": "placement training train-the-trainer"
  },
  {
    "url": "https://www.svce.ac.in/placement/?page=major-recruiters",
    "content": "\nCategory_Top Companies\nEngineering_L&T, DOW Chemical, TATA Chemicals, Caterpillar Inc., Saint-Gobain, Sanmar Group, TechnipFMC, McDermott, WABCO, TITAN, Valeo, Vestas, FLSmidth, Microchip Technology, Bosch Group, Wood Plc\nAutomobile_Hyundai Motor India, Ashok Leyland, Renault–Nissan, Royal Enfield, TAFE, Daimler, Yamaha Motor India, MRF, TVS Motor Company, Ford\nConstruction_URC, L&T, HOCHTIEF, CCCL, Coromandel Engineering, CBRE\nAnalytics_Tiger Analytics, Mu Sigma, LatentView Analytics, Global Analytics, TheMathCompany, ZoomRx, Mad Street Den, ADF Data Science\nIT Services_Cognizant, Infosys, Accenture, Wipro, IBM, Capgemini, TCS, Tech Mahindra, Hexaware Technologies, DXC Technologies\nIT Product_Amazon, Google, PayPal, ZOHO, Freshworks, Dell R&D, Sapient, Samsung, Temenos, Nielsen, Oracle, Barclays\nConsulting_McKinsey & Company, Deloitte, EY, KPMG, PWC, Morgan Stanley, SAP, Goldman Sachs\n",
    "keywords": "placement major-recruiters"
  },
  {
    "url": "https://www.svce.ac.in/placement/?page=list-of-recruiters",
    "content": "\nList of Placement Companies Visited\n☀   Cognizant\t☀   Infosys\t☀   Accenture\n☀   Tata Consultancy Services - TCS\t☀   Wipro Limited\t☀   Capgemini Technology Services India Limited\n☀   HCL Technologies Limited\t☀   Hexaware Technologies\t☀   IBM india Ltd.\n☀   L & T Infotech Ltd.\t☀   EY India\t☀   Goldman Sachs\n☀   Google India\t☀   Microsoft Ltd.\t☀   Atlassian\n☀   Amazon\t☀   Astrazeneca Ltd.\t☀   Aspire Systems\n☀   Brakes India Ltd\t☀   ABB India Limited\t☀   Honeywell Ltd.\n☀   FLSmidth Private Limited\t☀   Ford India\t☀   Hyundai Motor Engg Ltd, Hydrabad.\n☀   Hyundai Motors I Ltd.,\t☀   AT & T Telecome Ltd.\t☀   Atos|Syntel\n☀   Caterpillar India Pvt Ltd\t☀   General Motors India Pvt. Ltd.\t☀   Dell India R&D\n☀   Deloitte\t☀   Mindtree Ltd.,\t☀   Delphi - TVS Technologies Limited\n☀   EmbedUR Systems Pvt Ltd\t☀   ZoomRx Health Care Pvt. Ltd.\t☀   MulticoreWare Ltd.\n☀   Odessa Technologies\t☀   Zifo RnD Solutions\t☀   Dow Chemicals Ltd.\n☀   DXC Technology\t☀   ELGI Equipments Limited\t☀   MRF Ltd.\n☀   Rane Group\t☀   Renault Nissan Automotive India Private Limited\t☀   Royal Enfield Ltd.\n☀   Saipem Ltd.\t☀   SAME Tractors Ltd.\t☀   Samsung India Electronics\n☀   Sanmar Group\t☀   Sanmina-SCI Technology India Pvt. Ltd.\t☀   Yamaha Motor India\n☀   ABCO India Private Ltd\t☀   Accuspeed Engineering Services India Limited\t☀   Achira Labs Pvt. Ltd.\n☀   Acies Global\t☀   Adani Ports and Special Economic Zone Ltd.\t☀   Adonis staff services Pvt Ltd\n☀   Agappe Diagnostics Ltd\t☀   Agilisium Consulting\t☀   AIG Ltd.\n☀   Aithent Technologies\t☀   Akamai Technologies India Pvt. Ltd.\t☀   Aliens Group\n☀   Altimetrik India Pvt Ltd\t☀   Amadasoft India Pvt. Ltd.\t☀   American Megatrends Technologies India Pvt Ltd.\n☀   AMS Semiconductors India Pvt Ltd\t☀   Amuse3D\t☀   ANB Systems Private Limited\n☀   AON Consulting Pvt. Ltd\t☀   APA Engineering Pvt. Ltd.\t☀   Aqua Designs India Private Limited\n☀   Archean Group\t☀   Archit Builders Private Limited\t☀   Areva Ltd.\n☀   Aricent Ltd.\t☀   Arjun Chemicals Ltd.\t☀   Ashok Leyland Ltd.\n☀   AssessPeople Services Ltd.\t☀   Athena Health Ltd.\t☀   Auga Engineers Ltd.\n☀   Aurous HealthCare R&D India Pvt Ltd\t☀   Bahwan Cyber tech Ltd.\t☀   Berger Paints Ltd.\n☀   Beroe Ltd.\t☀   BGR Energy Ltd.,\t☀   Bharat Electronics Ltd.\n☀   Biocon Ltd.\t☀   Birla Soft Ltd.\t☀   Bonfiglioli Ltd.,\n☀   Bridge Solutions Group Ltd.,\t☀   BRIDGEi2i Analytics Solutions Pvt. Ltd.\t☀   Broadridge Financial Solutions\n☀   BTLIMS Technologies\t☀   Buddihealth Technologies\t☀   Business Octane Solutions Pvt. Ltd.\n☀   Byju’s - Think and Learn Pvt Ltd.\t☀   CAD Soft Pvt Ltd\t☀   Caparo Engineering India Limited\n☀   CaratLane Trading Pvt Ltd\t☀   Caritor Solutions India Private Limited\t☀   CEI India Pvt Ltd.\n☀   Cerium Systems (P) Ltd.\t☀   Cethar Energy Limited\t☀   Chargebee\n☀   CherryTin Online Pvt. Ltd.\t☀   Climber knowledge and Careers Pvt Ltd\t☀   CMS IT Services Pvt Ltd\n☀   Codingmart Technologies\t☀   Commvault\t☀   CSS Corp\n☀   Cyber Security Works Pvt. Ltd\t☀   Data Patterns India Pvt. Ltd.\t☀   Decathlon Sports India Private Limited\n☀   Delium Technologies\t☀   Detroit Engineered Products (DEP) India Ltd.\t☀   Dexterity Business Analyst Ltd.\n☀   DHL Logistics Pvt Ltd\t☀   Dieffenbacher India Pvt Ltd\t☀   doodleblue Innovations Private Limited\n☀   Double Down Retail Private Limited\t☀   Duta Software India Pvt Ltd\t☀   EASi Engineering Services Pvt Ltd\n☀   Easy Solutions Pvt Ltd\t☀   EbiX Technologies Pvt. Ltd.\t☀   e-con Systems India Private Limited\n☀   Efficient Frontiers International Limited\t☀   Elait IT Technology Services Pvt Ltd.\t☀   eLitmus Evaluation Private Limited\n☀   elmex Controls Pvt Ltd\t☀   EPIKInDiFi Software & Solutions Pvt Ltd\t☀   Episource India Private Limited\n☀   Ericsson India Global Services\t☀   Ethna Attributes Soft Technologies Pvt Ltd\t☀   ETHNUS\n☀   Eurovigil Security Systems\t☀   Exeter Premedia India Pvt Ltd\t☀   Expeditors International (India) Pvt. Ltd.\n☀   Extreme Networks Pvt. Ltd\t☀   Fichtner Consulting Engineers (India) Private Limited\t☀   FICO\n☀   Fidelity Business Services India Private Ltd.\t☀   FIITJEE\t☀   Fisher Chennai Engineering Ltd.\n☀   FixNix Inc.\t☀   Flender Drives Private Limited\t☀   Flex India Ltd.\n☀   Flinto Learning Solutions Pvt. Ltd.\t☀   Focus Academy Limited\t☀   Force10 Networks India Pvt. Ltd.\n☀   Ford Global Technology & Business\t☀   Formac Software Services Pvt.Ltd.\t☀   FourKites\n☀   FreightBro Logistics Pvt. Ltd.\t☀   Freshworks Inc.\t☀   Frost & Sullivan\n☀   FullCreative Technology Ltd.\t☀   Future Group Generl Insurance Ltd.\t☀   Futurenet Technologies India Pvt. Ltd.\n☀   G H Induction India Private Limited\t☀   GAVS Technologies Private Limited\t☀   Gboxz Technologies Pvt. Ltd.\n☀   Genesys\t☀   Gigamon\t☀   Gislen Software Private Limited\n☀   Global Analytics India Private Limited\t☀   Global Scholar Ltd.\t☀   GlobalEdge (Altran Group)\n☀   Glosys Technology Solutions Pvt. Ltd.\t☀   Godrej & Boyce Mfg. Co. Ltd.\t☀   GOFRUGAL Technologies Pvt Ltd\n☀   GoldenPay Ltd.\t☀   Grinntech Motors & Services Pvt. Ltd.\t☀   GSS Software Ltd.\n☀   Gulf SPIC Ltd.\t☀   Harphil Ltd.,\t☀   Hatch Ltd.,\n☀   HBSC Ltd.,\t☀   HDFC Bank\t☀   Helodent Ltd.,\n☀   Henkel Ltd.\t☀   Hinduja Foundaries Ltd.\t☀   Hinduja Technology Ltd.,\n☀   Hip Bar Private Limited\t☀   Huawei Communications Ltd.\t☀   Hub Stream Ltd.,\n☀   Hubstream India Private Limited\t☀   Hyundai Mobis\t☀   IDBI Bank\n☀   IDBI Insurance(IT Division)\t☀   iFlex Solutions Ltd.\t☀   IHITA Engineering Services Ltd.,\n☀   ImplementHIT Ltd.\t☀   Inatech India Private Limited\t☀   IndaiMart Ltd.,\n☀   Indian oil Tanking Ltd.\t☀   Indussoft Ltd.,\t☀   Infomatica Ltd.,\n☀   Ingram Micro India SSC Pvt Ltd.,\t☀   INS-ZOOMS Ltd.,\t☀   JINTECH Ltd.,\n☀   JRA Analytics Ltd.,\t☀   Juspay Technologies Private Limited\t☀   JustDial Ltd.,\n☀   K-7 Computing Ltd.,\t☀   KAAR Technologies\t☀   Kadamba Technology\n☀   Kalgudi\t☀   KBR Ltd.,\t☀   KCC Paints Ltd.\n☀   KCP Limited\t☀   KEC International Ltd.\t☀   Keyence India Ltd.,\n☀   Kirloskar Brother Ltd.,\t☀   KLA Tencor Ltd.\t☀   Klenty\n☀   Kothari petro Chemicals Ltd.\t☀   Krazybee Services Private Limited\t☀   Krishco Infolabs Pvt Ltd.,\n☀   L & T Ltd.,\t☀   L & T ECC Division\t☀   L & T Engineering Services Ltd.\n☀   L & T Infra Ltd.\t☀   L & T Technology Services Ltd.\t☀   LatentView Ltd.,\n☀   L-Cube Innovative Solutions Pvt. Ltd.\t☀   LeadSquared\t☀   Lennox Ltd.,\n☀   Lister Digital\t☀   Lister Technologies Ltd.\t☀   Logic Information Systems Ltd.\n☀   Logitech Ltd.\t☀   Lucas TVS Ltd.,\t☀   Lutron Tech Ltd.,\n☀   Mad Street Den\t☀   Madras Cements Ltd.\t☀   Madras Engineering Industries Private Limited\n☀   Maestro Steel Detailing Inc.,\t☀   Magna Automotive Pvt Ltd.,\t☀   Mahindra Satyam Ltd.\n☀   MARG Ltd.\t☀   Markets and Markets Research Private Ltd.\t☀   Mastech InfoTrellis\n☀   Matrimony Ltd.,\t☀   Maventic Innovative Solutions Pvt Ltd\t☀   Maveric Systems\n☀   May Softtech Ltd.,\t☀   Mbit Wireless Pvt Ltd.\t☀   Mckinsey & Company\n☀   Mech Tech Projects Ltd.,\t☀   Media.Net\t☀   Michelian Tyres Ltd.,\n☀   MicorChip Ltd.,\t☀   Milky Delight\t☀   Mind Speed Ltd.,\n☀   Minda Group Ltd.\t☀   Mindtree\t☀   Mitsubishi Motors Ltd.\n☀   MK Autocomponent Ltd.,\t☀   MoCDoc\t☀   Mocero Health Solutions Pvt Ltd\n☀   Mphasis Limited\t☀   MPL Plastics Ltd.\t☀   MQ Spectrum (India) Pvt Ltd\n☀   Mr.Cooper\t☀   MSC Technology (India) Private Limited\t☀   Msys Technologies\n☀   Mu Sigma Ltd.\t☀   Nagarjuna Oils & Chemicals Ltd.\t☀   Napesco India LLP\n☀   Navis (Cargotec Corporation)\t☀   Neel Industries Private Limited\t☀   Neeyamo Enterprise Solutions Ltd.\n☀   Net Access Private Limited\t☀   Newgen Software\t☀   Nidhyana Construction Company Pvt.Ltd\n☀   Ninjacart Ltd.\t☀   Nippon Paint India\t☀   Novac Technology Solutions Pvt. Ltd.\n☀   NSK Bearings India Private Limited\t☀   NTT DATA Corporation\t☀   Nucleus Software Exports Limited\n☀   Nuvent Technologies Pvt. Ltd.\t☀   NVR Infra Private Limited\t☀   Odyssey Technologies Ltd\n☀   OpenText\t☀   OptumInsight India Private Limited\t☀   Oracle Financials Ltd.\n☀   Orckit Tech Ltd.\t☀   Orion India Systems Pvt Ltd\t☀   Parker-Hannifin Corporation\n☀   Parle Agro Private Limited\t☀   PayPal\t☀   Perlos Telecomunications Ltd.\n☀   Perspecte Solutions Private Limited\t☀   Petro6 Engineering & Constructions Pvt Ltd\t☀   Petrofac Limited\n☀   Petrostar Corporation Ltd.\t☀   Pfizer India Ltd.\t☀   Phorotech Surfin India Private Limited\n☀   Photon Interactive Private Limited\t☀   Pickyourtrail\t☀   Plintron Global Technology Solution Pvt Ltd\n☀   Polaris Financial Technology\t☀   Pratian Technologies\t☀   Prodapt Solutions Pvt Ltd\n☀   Projectheen\t☀   Prokarma Softech Pvt Ltd\t☀   Protechsoft Technologies Pvt. Ltd.\n☀   Prudent.ai\t☀   Pushpak Electric Vehicles Ltd.,\t☀   Qube Cinema Technologies\n☀   Radial Omnichannel Technologies\t☀   Ramco Cements Limited\t☀   RAMCO Systems Ltd.\n☀   Saggezza India Pvt Ltd\t☀   SAI Technology Private Limited\t☀   Saint-Gobain\n☀   Sasken Technologies Ltd.\t☀   Saud Bahwan Groups\t☀   SCHWING Stetter (India) Pvt. Ltd.\n☀   SCM Micro System Ltd.\t☀   Scope e-Knowledge Center (P) Ltd.\t☀   Securight Technologies Pvt Ltd\n☀   Seetharam Mechatronics Pvt Ltd.\t☀   Severn Glocon India Pvt Ltd\t☀   Shree Abirami Engineering Works\n☀   Shriram Value Services\t☀   Siemens Technology and Services Private Limited\t☀   Sigaram Technologies\n☀   Sim Infosystems Pvt Ltd\t☀   Sirena Technologies Pvt Ltd\t☀   Six Red Marbles, Inc.\n☀   Sixth Energy Technology Pvt Ltd\t☀   Skill-Lync\t☀   Softura Private Ltd\n☀   Solartis Technology Services Pvt. Ltd\t☀   Sopra Steria Ltd.\t☀   SPIC Ltd.\n☀   SRF Limited\t☀   SRM Technologies Ltd.\t☀   Standard Chartered Bank Ltd.\n☀   Steel Strips Wheels Limited\t☀   Stradegi Solutions\t☀   Sundaram - Clayton Limited\n☀   Sundram Fasteners Limited\t☀   Super Auto Forge Private Limited\t☀   Sureti IMF\n☀   Switzer Process Instruments Pvt Ltd\t☀   Symbioun Technologies Pvt Ltd.\t☀   Syrma Technology\n☀   Systech Solutions Private Ltd\t☀   TAFE Ltd.\t☀   Tata AIG Ltd.\n☀   Tata Chemicals Limited\t☀   Tata Communications Limited\t☀   Tata Elxsi Ltd\n☀   TECHCIG .Com\t☀   Techlivz Software Private Limited\t☀   TechMahindra\n☀   Technicolor Ltd.\t☀   TechnipFMC\t☀   Technoarete R&D Ltd.\n☀   Techron Systems Private Limited\t☀   TechZone Solutions Pvt Ltd\t☀   Telcordia Technologies India Pvt Ltd\n☀   Temenos AG\t☀   Tesco Ltd.\t☀   Tevel Cyber Corps Private Limited\n☀   TheMathCompany\t☀   Thermax Limited\t☀   Thirumalai Chemicals Ltd.\n☀   Thorogood Associates Ltd.\t☀   ThoughtWorks\t☀   TI Cycles India\n☀   Tiger Analytics\t☀   TITAN Company Limited\t☀   TNQ Technologies Pvt. Ltd.\n☀   Toshiba Machine Private Limited\t☀   TPL Ltd.\t☀   Triad Software Pvt. Ltd\n☀   Turbo Energy Private Limited\t☀   TVM Signalling and Transport System Ltd.\t☀   TVS Electronics Ltd.\n☀   TVS Motor Company Ltd.\t☀   TVS Next Limited\t☀   Ucal Fuel Systems Ltd\n☀   VA Tech Wabag Ltd\t☀   Valeo India Pvt. Ltd.\t☀   Valued Epistemics Private Limited\n☀   Vedanta Limited\t☀   Vedanta MALCO Ltd.\t☀   Vembu Technologies Pvt Ltd\n☀   Ventuno Technologies Private Limited\t☀   Verizon Data Services India Private Limited\t☀   Vestas Wind Technology India Pvt Ltd\n☀   Virtusa India Pvt. Ltd.\t☀   Visteon Automotive Systems India\t☀   Vortex Engineering Pvt. Ltd.\n☀   VVDN Technologies\t☀   Waffor Retail Solutions (P) Ltd.\t☀   West Agile Labs\n☀   Wheels India Limited\t☀   Wiley-Mthree\t☀   Wipro Infrastructure Engineering Ltd.\n☀   Wolters Kluwer Ltd.\t☀   WoodPlc Ltd.\t☀   Zen Linen International Private Limited\n☀   Zilker Technology India Private Limited\t☀   Zoho Corporation    \n",
    "keywords": "placement list-of-recruiters"
  },
  {
    "url": "https://www.svce.ac.in/placement/?page=packages-offered",
    "content": "\nAverage CTC (In Lacs)\n2017-18 4.4\n2018-19 4.55\n2019-20 4.7\n2020-21 5.3\n2021-22 5.7\n",
    "keywords": "placement packages-offered"
  },
  {
    "url": "https://www.svce.ac.in/placement/?page=placement-statistics",
    "content": "\nHighest CTC Graph of our Students. (Batch 2021 - 22)\n    Your greatest accomplishment is our happiness.\n        Atlassian\n        Amazon\n        PayPal    \n",
    "keywords": "placement placement-statistics"
  },
  {
    "url": "https://www.svce.ac.in/placement/?page=feedback",
    "content": "\nFeedback\n    Thanks for all the great support you have provided to the recruiting process. The candidates were enthusiastic and enhanced by core elements. I'm looking forward to joining us.\n    -Mr A Ravindra Babu, Director, EY\n\n    The students are very involved and highly professional. Next year we would be happy to visit the campus.\n    -Mr Arati Mohanram, AVP and India HR Head, Mr.Cooper Group\n",
    "keywords": "placement feedback"
  },
  {
    "url": "https://www.svce.ac.in/placement/?page=feedback&subMenu=recruiters",
    "content": "\nRecruiters\n    Thanks for all the great support you have provided to the recruiting process. The candidates were enthusiastic and enhanced by core elements. I'm looking forward to joining us.\n    -Mr A Ravindra Babu, Director, EY\n\n    The students are very involved and highly professional. Next year we would be happy to visit the campus.\n    -Ms Arati Mohanram, AVP and India HR Head, Mr.Cooper Group\n\n    The students were happy to be included in our founding party. The team is filled with resources, experience and ideas. We look forward to a synergical partnership in future and recruit many more of you for our other ventures from your respected institution.\n    -Ms Kanchan Khedkar, AGM-HR, HCL Technologies Ltd\n\n    Excellent campus and good facilities. Well organized and friendly personnel. Students are extremely intelligent and maintain the flag of this institution.\n    --Mr Jabeel Ismail, Manager-Recruitment, Hexaware Technologies \n\n    Students over here are excellent and they are well trained for the placement process. Excellent coordination of Campus Drive. Overall we are happy to hire the students from SVCE.\n    -Mr T Saravanan, Vice President – HR, Gavs Technologies    \n",
    "keywords": "placement feedback recruiters"
  },
  {
    "url": "https://www.svce.ac.in/placement/?page=preparation-for-placement",
    "content": "\nPreparation for Placement\n    Placement training plays a major role in shaping up the career goals of students. It is the dream of every engineering student to get placed in a top organization visiting their campus for recruitment. Keeping this key aspect into consideration, it is realized that training is important for engineering students to enhance their employability skills and achieve good placement in various Industries.\n        To create awareness about \"career planning\" and \"career mapping\" among the students.\n        To train the students on \"Personality development\".\n        To organize Various Training Programmes to train the students in the areas of Quantitative Aptitude, Logical reasoning and Verbal reasoning.\n        To train the students through Mock Interviews to perform well in the professional interviews as per the Industries expectations.    \n",
    "keywords": "placement preparation-for-placement"
  },
  {
    "url": "https://www.svce.ac.in/placement/?page=contact",
    "content": "\nContact - Placement Cell\n    placement@svce.ac.in svceplacement@gmail.com\n    9894229979\n    27152000 Ext.875    \n",
    "keywords": "placement contact"
  }
]
